lighttransport/gemm/common/sam3d_body_decoder.h
/*
 * sam3d_body_decoder.h — sam-3d-body promptable decoder + MHR head.
 *
 * Usage:
 *   #define SAM3D_BODY_DECODER_IMPLEMENTATION
 *   #include "sam3d_body_decoder.h"
 *
 * Dependencies: ggml_dequant.h, safetensors.h, cpu_compute.h
 *
 * Architecture (confirmed by step-1 safetensors probe):
 *   - 6 decoder layers, token dim=1024, n_heads=8, head_dim=64
 *   - Cross-attention q from tokens (1024→512), k/v from image (1280→512)
 *   - Self-attention q/k/v all 1024→512
 *   - FFN hidden = 1024 (not 4× — small FFN)
 *   - Per-layer norms: ln1, ln2_1, ln2_2 (1280), ln3, ln_pe_1, ln_pe_2 (1280)
 *   - Input projections: init_to_token_mhr (Linear 525→1024),
 *     prev_to_token_mhr (Linear 522→1024), prompt_to_token (Linear 1280→1024)
 *   - Learnable embeddings: keypoint_embedding (70, 1024),
 *     keypoint3d_embedding (70, 1024), hand_box_embedding (2, 1024)
 *   - Keypoint-token update: keypoint_feat_linear (1280→1024),
 *     keypoint_posemb_linear (MLP 2→1024→1024→1024),
 *     keypoint3d_posemb_linear (MLP similar, 3D)
 *   - ray_cond_emb: Conv2d(1379, 1280, 1×1) + LN(1280) — added to image tokens
 *   - hand_pe_layer.positional_encoding_gaussian_matrix: (2, 640) SAM PE
 *
 * MHR head (in separate safetensors file sam3d_body_mhr_head.safetensors):
 *   - head_pose.proj: FFN(1024 → 1024 → 519)
 *   - head_camera.proj: FFN(1024 → 1024 → 3)
 *   - init_pose.weight: (1, 519); init_camera.weight: (1, 3)
 *   - bbox_embed: MLP(1024 → 1024 → 1024 → 4) (hand detection)
 *   - head_pose.{scale_mean, scale_comps, keypoint_mapping, faces,
 *     joint_rotation, hand_pose_{mean,comps}, ...} — MHR skinning buffers
 *
 * Scope v1:
 *   - Body branch only (skip _hand variants)
 *   - Empty prompts (dummy keypoints [0, 0, -2])
 *   - DINOv3 32x32 and ViT-H 32x24 image-token grids
 *   - Produces 519 MHR params + 3 cam_t values; focal from runner's fov hint.
 *
 * The implementation covers ray conditioning, token construction, all six
 * decoder layers, iterative keypoint-token updates, final MHR/camera heads,
 * and the public wrapper used by the CPU/CUDA runners.
 */

#ifndef SAM3D_BODY_DECODER_H
#define SAM3D_BODY_DECODER_H

#include <stdint.h>
#include <stddef.h>
#include "ggml_dequant.h"

#ifdef __cplusplus
extern "C" {
#endif

#define SAM3D_BODY_DECODER_E_OK              (0)
#define SAM3D_BODY_DECODER_E_INVAL           (-1)
#define SAM3D_BODY_DECODER_E_NOT_IMPLEMENTED (-2)
#define SAM3D_BODY_DECODER_E_LOAD            (-3)

#include "qtensor_utils.h"

/* ---- Per-layer weights (TransformerDecoderLayer in upstream) ------ */
typedef struct {
    /* Pre-norms for token / image streams. ln_pe_{1,2} normalize the
     * token_augment / image_augment PE streams separately. */
    qtensor ln1_w,    ln1_b;      /* LN on tokens before self-attn */
    qtensor ln_pe_1_w,ln_pe_1_b;  /* LN on token_augment */
    qtensor ln2_1_w,  ln2_1_b;    /* LN on tokens before cross-attn */
    qtensor ln2_2_w,  ln2_2_b;    /* LN on image (1280) before cross-attn */
    qtensor ln_pe_2_w,ln_pe_2_b;  /* LN on image_augment (1280) */
    qtensor ln3_w,    ln3_b;      /* LN on tokens before FFN */

    /* Self-attention: 1024 → 512 per projection, out 512 → 1024. */
    qtensor sa_q_w, sa_q_b;   /* (512, 1024) */
    qtensor sa_k_w, sa_k_b;   /* (512, 1024) */
    qtensor sa_v_w, sa_v_b;   /* (512, 1024) */
    qtensor sa_proj_w, sa_proj_b; /* (1024, 512) */

    /* Cross-attention: q 1024→512, k/v 1280→512, out 512→1024. */
    qtensor ca_q_w, ca_q_b;   /* (512, 1024) */
    qtensor ca_k_w, ca_k_b;   /* (512, 1280) */
    qtensor ca_v_w, ca_v_b;   /* (512, 1280) */
    qtensor ca_proj_w, ca_proj_b; /* (1024, 512) */

    /* FFN: 1024 → 1024 → 1024 (ffn.layers.0.0 + ffn.layers.1). */
    qtensor ffn0_w, ffn0_b;   /* (1024, 1024) */
    qtensor ffn1_w, ffn1_b;   /* (1024, 1024) */
} sam3d_body_decoder_layer;

/* ---- Full decoder model (body branch only, v1). ------------------- */
typedef struct sam3d_body_decoder_model_t {
    /* Config. */
    int n_layers;      /* 6 */
    int dim;           /* 1024 (token channel) */
    int kv_dim;        /* 1280 (image channel, DINOv3 output) */
    int n_heads;       /* 8 */
    int head_dim;      /* 64 (proj dim 512 / 8) */
    int ffn_hidden;    /* 1024 */
    int n_keypoints;   /* 70 */
    int n_hand_tokens; /* 2 */
    int npose;         /* 519 (from MHR head) */
    int ncam;          /* 3 */
    int cond_dim;      /* 3 */
    int kp_sample_scale_x; /* ViT-H width-crop correction for kp grid_sample. */
    float ln_eps;      /* 1e-6 */

    /* Input projections. */
    qtensor init_to_token_w, init_to_token_b;  /* (1024, npose+ncam+cond) = (1024, 525) */
    qtensor prev_to_token_w, prev_to_token_b;  /* (1024, npose+ncam)      = (1024, 522) */
    qtensor prompt_to_token_w, prompt_to_token_b; /* (1024, 1280) */

    /* Learnable embeddings. */
    qtensor keypoint_embedding;       /* (70, 1024) */
    qtensor keypoint3d_embedding;     /* (70, 1024) */
    qtensor hand_box_embedding;       /* (2, 1024) */

    /* Keypoint-token update path. */
    qtensor kp_feat_linear_w, kp_feat_linear_b;     /* (1024, 1280) */
    /* keypoint_posemb_linear: FFN(2, 1024, 1024, 1024) — upstream MLP with 2 hidden FC. */
    qtensor kp_posemb_l0_w, kp_posemb_l0_b;         /* (1024, 2) */
    qtensor kp_posemb_l1_w, kp_posemb_l1_b;         /* (1024, 1024) */
    /* keypoint3d_posemb_linear: same shape but input 3. */
    qtensor kp3d_posemb_l0_w, kp3d_posemb_l0_b;     /* (1024, 3) */
    qtensor kp3d_posemb_l1_w, kp3d_posemb_l1_b;     /* (1024, 1024) */

    /* Ray conditioning (adds to image embeddings before decoder). */
    qtensor ray_cond_conv_w, ray_cond_conv_b;       /* (1280, 1379, 1, 1) */
    qtensor ray_cond_norm_w, ray_cond_norm_b;       /* (1280,) */
    /* SAM-style random-projection PE.
     * `prompt_pe_gauss` is the body decoder's prompt_encoder.pe_layer
     * gaussian matrix (used by get_dense_pe to build the (1280, H, W)
     * context positional encoding consumed as `image_pe`/`context_pe`
     * by the decoder). `hand_pe_gauss` is the analogous matrix for the
     * hand decoder branch (unused in v1 body-only path). */
    qtensor prompt_pe_gauss;                        /* (2, 640) */
    qtensor hand_pe_gauss;                          /* (2, 640) */
    /* Single-token "invalid" prompt embedding used when no real
     * keypoint prompts are supplied; broadcast to (B, 1, 1280) and fed
     * through prompt_to_token. */
    qtensor invalid_point_embed;                    /* (1, 1280) */
    /* Dense no-mask embedding added to backbone image embeddings before
     * ray_cond_emb when no binary mask prompt is supplied. */
    qtensor no_mask_embed;                          /* (1, 1280) */

    /* Per-layer weights. */
    sam3d_body_decoder_layer *layers;               /* [n_layers] */

    /* Final norm after all decoder layers. */
    qtensor norm_final_w, norm_final_b;             /* (1024,) */

