lighttransport/gemm/common/sam3d_body_decoder.h
    /* MHR head (loaded from sam3d_body_mhr_head.safetensors). */
    qtensor head_pose_l0_w, head_pose_l0_b;         /* (1024, 1024) */
    qtensor head_pose_l1_w, head_pose_l1_b;         /* (519, 1024) */
    qtensor head_camera_l0_w, head_camera_l0_b;     /* (1024, 1024) */
    qtensor head_camera_l1_w, head_camera_l1_b;     /* (3, 1024) */
    qtensor init_pose;       /* (1, 519) — learnable init MHR param token */
    qtensor init_camera;     /* (1, 3)   — learnable init cam_t token */

    /* MHR head decode buffers (stages 1-5 + 12). All from head_pose.* in
     * sam3d_body_mhr_head.safetensors. */
    qtensor scale_mean;       /* (68,)        f32 */
    qtensor scale_comps;      /* (28, 68)     f32 */
    qtensor hand_pose_mean;   /* (54,)        f32 */
    qtensor hand_pose_comps;  /* (54, 54)     f32 */
    qtensor hand_idx_left;    /* (27,)        i64 — into 133-dim body_pose */
    qtensor hand_idx_right;   /* (27,)        i64 */
    qtensor keypoint_mapping; /* (308, 18566) f32 */
    qtensor local_to_world_wrist; /* (3, 3)   f32 — wrist-frame transform */
    qtensor right_wrist_coords;   /* (3,)     f32 */
    qtensor root_coords;          /* (3,)     f32 */
    qtensor nonhand_param_idxs;   /* (145,)   i64 — zeroed in model_params */
    qtensor faces;                /* (36874, 3) i64 — mesh triangle indices */

    /* Optional hand-bbox detection head (unused in v1 body-only path). */
    qtensor bbox_embed_l0_w, bbox_embed_l0_b;       /* (1024, 1024) */
    qtensor bbox_embed_l1_w, bbox_embed_l1_b;       /* (1024, 1024) */
    qtensor bbox_embed_l2_w, bbox_embed_l2_b;       /* (4, 1024) */
    qtensor hand_cls_w, hand_cls_b;                 /* (2, 1024) */

    /* Backing buffer for parsed safetensors (kept alive until free). */
    void *_st_decoder;   /* decoder safetensors context */
    void *_st_mhr_head;  /* mhr_head safetensors context */
} sam3d_body_decoder_model;

/* Result from forward(): 519 MHR params + 3 cam_t. */
typedef struct {
    float mhr_params[519];
    float cam_t[3];
} sam3d_body_decoder_result;

/* ---- Public API. All loaders: NULL on failure. -------------------- */

/* Load both safetensors files (decoder + mhr_head) and populate model. */
sam3d_body_decoder_model *sam3d_body_decoder_load(const char *decoder_sft,
                                                  const char *mhr_head_sft);
void                      sam3d_body_decoder_free(sam3d_body_decoder_model *m);

/* sam3d_body_decoder_forward — convenience entry point that bundles
 * ray_cond_emb + get_dense_pe + build_tokens + forward_full in one call.
 * Definition is placed below the struct definitions (see after
 * sam3d_body_decoder_forward_full). */

/*
 * ray_cond_emb sub-module (step 4c): apply Conv2d(1379,1280,1x1) + LN2d
 * to (image_embeddings ⊕ fourier(rays_xyz)).
 *
 *   image_emb: (1280, 32, 32) f32, channel-first, patch-token grid
 *   rays_xyz:  (32, 32, 3)    f32, per-spatial (dx, dy, 1) after the
 *              downsample + z-append. Produces a 99-dim fourier feature
 *              per position (3 raw + 16×3 sin + 16×3 cos).
 *   out:       (1280, 32, 32) f32
 *
 * Fourier bands: linspace(1, 32, 16) per axis, sin/cos(π·pos·band).
 * LN2d eps = 1e-6, applied per-spatial over the 1280 channels.
 */
int sam3d_body_ray_cond_emb_forward(const sam3d_body_decoder_model *m,
                                    const float *image_emb,
                                    const float *rays_xyz,
                                    int H, int W,
                                    int n_threads,
                                    float *out);

/*
 * SAM PositionEmbeddingRandom.get_dense_pe: build the (embed_dim, H, W)
 * dense positional encoding consumed as `image_pe`/`context_pe` by the
 * decoder cross-attention. Uses the prompt_encoder.pe_layer gaussian
 * matrix (m->prompt_pe_gauss, shape (2, embed_dim/2)).
 *
 * For each grid cell (yi, xi) the (x, y) center is normalized to the
 * square crop grid. DINOv3 uses H==W. ViT-H uses a 32x24 embedding grid
 * sliced from the center of the 32x32 crop, so x is offset by (H-W)/2
 * and normalized by H, not W.
 *
 *   out: (embed_dim=1280, H, W) f32, contiguous CHW layout.
 *
 * embed_dim is inferred from the gaussian matrix (cols × 2).
 */
int sam3d_body_get_dense_pe(const sam3d_body_decoder_model *m,
                            int H, int W, int n_threads, float *out);

/*
 * Build the prompt input for build_tokens when no real keypoints are
 * supplied: equivalent to running prompt_encoder on a single dummy
 * keypoint with label==-2 (invalid). Output is the (1280,) vector that
 * gets fed as `prompt_in` to sam3d_body_build_tokens.
 *
 *   out: (embed_dim=1280,) f32 — m->invalid_point_embed.weight.
 */
int sam3d_body_invalid_prompt_token(const sam3d_body_decoder_model *m,
                                    float *out);

/*
 * Build the (1, H_out, W_out, 3) ray-condition tensor consumed by
 * ray_cond_emb_forward. Mirrors meta_arch.sam3d_body.get_ray_condition
 * + the in-CameraEncoder antialias-bilinear downsample + z-append.
 *
 * Steps (per upstream):
 *   1. meshgrid_xy = arange(H_in) × arange(W_in)              (H_in, W_in, 2)
 *   2. inverse-affine apply (only diagonal scale + col-2 trans)
 *   3. inverse-camera apply (subtract (cx, cy), divide by (fx, fy))
 *   4. If the output grid is rectangular (ViT-H: 32x24), center-crop
 *      the x ramp to the crop width before downsampling. Upstream crops
 *      the 512x512 body crop to 512x384 before the ViT-H patch embed.
 *   5. F.interpolate(antialias=True, bilinear, scale=1/patch_size)
 *      separable triangle kernel along H then W
 *   5. concat z=1 along the last axis
 *
 * Because the inverse-affine + inverse-camera transforms are
 * coordinate-only (x depends only on column j; y depends only on row
 * i), the H- and W- antialias filters reduce to a 1D triangle filter
 * applied independently to a precomputed H_in-long y-ramp and a
 * W_in-long x-ramp. Boundary clipping (output pixels near the image
 * edge see an asymmetric window) IS applied — matches PyTorch.
 *
 * Inputs:
 *   cam_int      (3,3)  fx, fy, cx, cy at indices [0,0],[1,1],[0,2],[1,2]
 *   affine_trans (2,3)  a00, a11, t02, t12 used; off-diagonal a01/a10
 *                       are assumed 0 (TopdownAffine for body always is)
 *   H_in, W_in          full input resolution (e.g. 512, 512)
 *   H_out, W_out        downsampled resolution (e.g. 32, 32)
 *
 * Output:
 *   out: (H_out, W_out, 3) f32, last channel = 1.0
 */
int sam3d_body_compute_ray_cond_xyz(const float *cam_int,
                                    const float *affine_trans,
                                    int H_in, int W_in,
                                    int H_out, int W_out,
                                    float *out);
int sam3d_body_compute_ray_cond_xyz_ex(const float *cam_int,
                                       const float *affine_trans,
                                       int H_in, int W_in,
                                       int H_out, int W_out,
                                       int dinov3_rect_reinterpret,
                                       float *out);

