lighttransport/gemm/common/sam3d_body_decoder.h
/*
 * Default camera intrinsics for sam-3d-body (prepare_batch.py).
 *   fx = fy = sqrt(W² + H²); cx = W/2; cy = H/2.
 * Output: cam_int (3, 3) row-major.
 */
void sam3d_body_default_cam_int(int W, int H, float *cam_int);

/*
 * fix_aspect_ratio (data/transforms/bbox_utils.py).
 * Input: scale (sw, sh); aspect_ratio = w/h target.
 * If sw > sh * aspect_ratio: scale = (sw, sw/aspect_ratio)
 *                      else: scale = (sh*aspect_ratio, sh)
 */
void sam3d_body_fix_aspect_ratio(const float *scale_in, float aspect_ratio,
                                 float *scale_out);

/*
 * get_warp_matrix (data/transforms/bbox_utils.py) for rot=0, shift=(0,0).
 * Input: center (2,) cx, cy; scale (2,) src_w (only [0] is used);
 *        output_size (out_w, out_h).
 * Output: warp_mat (2, 3) row-major.
 *
 * For rot=0: warp = (s, 0, out_w/2 - cx*s; 0, s, out_h/2 - cy*s)
 *   where s = out_w / src_w (note: y-scale also uses out_w, matching upstream).
 *
 * NOTE: upstream uses cv2.getAffineTransform on 3 src/dst points; for rot=0
 * the closed form above is exact (verified against the reference dump).
 */
void sam3d_body_get_warp_matrix(const float *center, const float *scale,
                                int out_w, int out_h, float *warp_mat);

/*
 * CLIFF condition_info (meta_arch.sam3d_body._get_decoder_condition).
 *   condition_info = ((cx - W/2)/f, (cy - H/2)/f, b/f)   if !use_intrin_center
 *   condition_info = ((cx - cam_cx)/f, (cy - cam_cy)/f, b/f)   else
 * where:
 *   cx, cy = bbox_center (pixels)
 *   f      = cam_int[0,0] (focal length)
 *   W, H   = ori_img_size
 *   b      = bbox_scale[0]
 *   cam_cx, cam_cy = cam_int[0,2], cam_int[1,2]
 *
 * Output: condition_info (3,).
 */
void sam3d_body_compute_condition_info(const float *bbox_center,
                                       const float *bbox_scale,
                                       const float *ori_img_size,
                                       const float *cam_int,
                                       int use_intrin_center,
                                       float *condition_info);

/*
 * GetBBoxCenterScale + TopdownAffine composition (data/transforms/common.py).
 *
 *   bbox_xyxy: (4,) [x1, y1, x2, y2]
 *   padding:   1.25 upstream
 *   aspect_ratio_pre: 0.75 upstream (first fix pass)
 *   out_w, out_h: 512, 512 upstream
 *
 * Output:
 *   center    (2,), scale (2,)   — final scale after TWO fix_aspect_ratio
 *                                  passes (0.75 then out_w/out_h)
 *   warp_mat  (2, 3)
 */
void sam3d_body_compute_bbox_affine(const float *bbox_xyxy,
                                    float padding,
                                    float aspect_ratio_pre,
                                    int out_w, int out_h,
                                    float *center,
                                    float *scale,
                                    float *warp_mat);

/*
 * cv2.warpAffine + ImageNet norm + HWC→CHW.
 *
 *   img_rgb_hwc: u8 (H_in, W_in, 3)
 *   warp_mat:    (2, 3) forward affine src→dst (same matrix cv2 accepts)
 *   out_chw:     f32 (3, H_out, W_out), normalized
 *
 * OOB pixels use 0 before normalization — i.e. output = (0/255 - mean)/std
 * for any dst pixel that maps outside the source image, matching
 * cv2.warpAffine(flags=INTER_LINEAR, borderMode=BORDER_CONSTANT, borderValue=0).
 */
int sam3d_body_preprocess_image(const uint8_t *img_rgb_hwc,
                                int W_in, int H_in,
                                const float *warp_mat_2x3,
                                int W_out, int H_out,
                                float *out_chw);

/*
 * Token construction (step 4d):
 *
 *   1. init_token   = init_to_token_mhr(init_input)   where
 *                     init_input = concat(condition_info(3), init_pose(519), init_camera(3))
 *                     → (1, 525), projected to (1, 1024).
 *   2. prev_token   = prev_to_token_mhr(prev_input)   where
 *                     prev_input = concat(init_pose(519), init_camera(3))
 *                     → (1, 522) (NO condition_info), projected to (1, 1024).
 *   3. prompt_token = prompt_to_token(prompt_in)      where
 *                     prompt_in = prompt_encoder(keypoints) → (1, 1280),
 *                     projected to (1, 1024).
 *
 * Assembly of 145-token stack:
 *
 *   x [B=1, 145, 1024]:
 *     [0]       = init_token (pose)
 *     [1]       = prev_token
 *     [2]       = prompt_token
 *     [3..4]    = hand_box_embedding.weight (2, 1024)
 *     [5..74]   = keypoint_embedding.weight (70, 1024)
 *     [75..144] = keypoint3d_embedding.weight (70, 1024)
 *
 *   x_pe [B=1, 145, 1024] (token_augment):
 *     [0]       = zeros
 *     [1]       = prev_token
 *     [2]       = prompt_token
 *     [3..144]  = zeros (kp posembs get populated later by the per-layer
 *                 keypoint_token_update_fn, step 4f)
 *
 * Inputs to this routine are the POST-concat flat vectors:
 *   init_input: (525,) f32  = [condition_info(3); init_pose(519); init_camera(3)]
 *   prev_input: (522,) f32  = [init_pose(519); init_camera(3)]
 *   prompt_in:  (1280,) f32 = prompt_encoder output (all-invalid keypoints case).
 *
 * Output buffers must be 145*1024 f32 each.
 */
int sam3d_body_build_tokens(const sam3d_body_decoder_model *m,
                            const float *init_input,   /* (525,) */
                            const float *prev_input,   /* (522,) */
                            const float *prompt_in,    /* (1280,) */
                            int n_threads,
                            float *x_out,     /* (145, 1024) */
                            float *x_pe_out); /* (145, 1024) */

/*
 * TransformerDecoderLayer forward (step 4e), body branch with repeat_pe=True.
 *
 *   layer_idx      ∈ [0, n_layers). Layer 0 has skip_first_pe=True, so its
 *                  self-attn does NOT add x_pe to q/k.
 *   x_in[N_q*D]    tokens, N_q=145, D=1024
 *   context_in[N_c*D_c]  image tokens, N_c=1024, D_c=1280
 *   x_pe_in[N_q*D]       token PE (token_augment). Normalized via ln_pe_1 internally.
 *   context_pe_in[N_c*D_c] image PE (image_augment). Normalized via ln_pe_2 internally.
 *   x_out[N_q*D]   updated tokens.
 *   context_out    unused with enable_twoway=False; caller may pass NULL.
 *                  If non-NULL, it is memcpy'd from context_in for API symmetry.
 */
int sam3d_body_decoder_layer_forward(const sam3d_body_decoder_model *m,
                                     int layer_idx,
                                     const float *x_in,
                                     const float *context_in,
                                     const float *x_pe_in,
                                     const float *context_pe_in,
                                     int N_q, int N_c,
                                     int n_threads,
                                     float *x_out,
                                     float *context_out);

