lighttransport/gemm/common/sam3d_body_decoder.h
/* Apply decoder.norm_final to the 145-token stack. Out same shape. */
int sam3d_body_norm_final(const sam3d_body_decoder_model *m,
                          const float *x_in,    /* (N_q, 1024) */
                          int N_q,
                          int n_threads,
                          float *x_out);

/*
 * Step 4g-ii: end-to-end decoder forward using PRESET per-layer pose
 * outputs. This bypasses the per-layer head_pose / camera_project /
 * _full_to_crop chain (which would require running MHR forward 5x — see
 * the iterative `forward_decoder_with_mhr` path planned for v1.1) and
 * instead consumes the (kp2d_cropped, kp2d_depth, kp3d) triplets the
 * caller has already computed (e.g. from the reference dumps for
 * verification, or from a separate MHR runner).
 *
 *   image_emb_chw    (kv_dim=1280, H, W) f32 — POST-ray_cond image
 *                    embeddings, channel-major. Used by both cross-attn
 *                    (after flatten + permute) and grid_sample inside
 *                    kp_token_update.
 *   image_pe_chw     (kv_dim=1280, H, W) f32 — image_augment (PE) channel
 *                    -major; flattened/permuted internally.
 *   initial_tokens   (N_q=145, D=1024) f32 — output of build_tokens.
 *   initial_augment  (N_q=145, D=1024) f32 — token_augment from build_tokens.
 *   kp2d_cropped_pl  (n_layers-1, K=70, 2)  f32 — per intermediate layer.
 *   kp2d_depth_pl    (n_layers-1, K=70)     f32
 *   kp3d_pl          (n_layers-1, K=70, 3)  f32 — POST-flip camera frame.
 *   out              filled with mhr_params (519) + cam_t (3); cam_t here
 *                    is just out_cam_raw (head_camera.proj output + init_camera);
 *                    the perspective_projection cam_t lives in the per-layer
 *                    pose_output instead.
 */
int sam3d_body_decoder_forward_preset(
    const sam3d_body_decoder_model *m,
    const float *image_emb_chw,
    const float *image_pe_chw,
    int H, int W,
    const float *initial_tokens,
    const float *initial_augment,
    const float *kp2d_cropped_pl,
    const float *kp2d_depth_pl,
    const float *kp3d_pl,
    int n_threads,
    sam3d_body_decoder_result *out);

/*
 * Step 4g-i: between-layer keypoint-token update (2D + 3D combined).
 *
 * Mirrors keypoint_token_update_fn_comb in upstream sam3d_body.py — runs
 * keypoint_token_update_fn (2D, kps_emb_start_idx=5) then
 * keypoint3d_token_update_fn (3D, kps3d_emb_start_idx=75).
 *
 *   layer_idx       per-layer index. The last layer (layer_idx == n_layers-1)
 *                   short-circuits to a pass-through (matches upstream
 *                   guard).
 *   image_emb       (kv_dim=1280, H, W) f32 — image embeddings AFTER ray_cond
 *                   (the same tensor passed as decoder context). Channel-major.
 *   H, W            spatial dims (H=W=32 for DINOv3 H+).
 *   kp2d_cropped    (70, 2) f32 — pose_output["pred_keypoints_2d_cropped"]
 *                   in [-0.5, 0.5] (output of _full_to_crop minus 0.5).
 *   kp2d_depth      (70,)   f32 — pose_output["pred_keypoints_2d_depth"]
 *                   (z-component before perspective divide; used to mask
 *                   behind-camera points with depth < 1e-5).
 *   kp3d_camera     (70, 3) f32 — pose_output["pred_keypoints_3d"], the
 *                   POST-flip (camera-frame) 3D points.
 *   N_q             token count (145 in body branch).
 *   tokens          (N_q, dim=1024) f32 in/out — kp_feat_linear feature
 *                   ADDED into rows [5..75); other rows untouched.
 *   token_augment   (N_q, dim=1024) f32 in/out — kp_posemb_linear written
 *                   to rows [5..75) (zeroed where invalid_mask is true);
 *                   kp3d_posemb_linear written to rows [75..145). Other
 *                   rows untouched.
 */
int sam3d_body_kp_token_update(const sam3d_body_decoder_model *m,
                               int layer_idx,
                               const float *image_emb,
                               int H, int W,
                               const float *kp2d_cropped,
                               const float *kp2d_depth,
                               const float *kp3d_camera,
                               int N_q,
                               int n_threads,
                               float *tokens,
                               float *token_augment);

/*
 * Apply the MHR pose + camera regression heads on the pose-token row of
 * the norm_final-output token stack (upstream: head_pose.proj(tokens[:,0])
 * and head_camera.proj(tokens[:,0]), each a 2-layer FFN(1024→1024→N) with
 * GELU between). Output is the "raw" projection (before + init_pose /
 * + init_camera), matching head_pose_proj_raw.npy / head_camera_proj_raw.npy.
 *
 *   pose_token:     (1024,) f32 — tokens_norm[0]
 *   out_pose_raw:   (519,) f32
 *   out_cam_raw:    (3,)   f32
 */
int sam3d_body_apply_heads_raw(const sam3d_body_decoder_model *m,
                               const float *pose_token,
                               int n_threads,
                               float *out_pose_raw,
                               float *out_cam_raw);

/*
 * Decode head_pose.proj raw output into MHR inputs (stages 1-5).
 *
 *   pose_raw: (519,) f32 = head_pose.proj raw + init_pose
 *
 *   pred_pose_raw breakdown:
 *     [0..6)     global_rot_6d
 *     [6..266)   pred_pose_cont (260)
 *     [266..311) shape (45)
 *     [311..339) scale (28)
 *     [339..447) hand (108) — left+right PCA-6D ×54
 *     [447..519) face (72) — zeroed in body-only path
 *
 * Outputs (caller-allocated):
 *   out_mhr_model_params (204): cat(full_pose_params(136), scales(68))
 *   out_shape            (45):  identity blend coefficients (= pred_shape)
 *   out_face             (72):  expression blend (zeros in body-only path)
 *
 * Per upstream MHRHead.forward:
 *   global_rot_euler = rotmat_to_euler("ZYX", rot6d_to_rotmat(global_rot_6d))
 *   pred_pose_euler  = compact_cont_to_model_params_body(pred_pose_cont)
 *                      with hand-mask + jaw zeroed
 *   full_pose_params = cat(zeros(3), global_rot_euler, pred_pose_euler[:130])
 *                      shape (136,); replace_hands_in_pose drops in hand
 *                      PCA decode at hand_idx_left / hand_idx_right.
 *   scales           = scale_mean + pred_scale @ scale_comps  shape (68,)
 *   model_params     = cat(full_pose_params, scales)          shape (204,)
 */
int sam3d_body_decode_pose_raw(const sam3d_body_decoder_model *m,
                               const float *pose_raw,
                               int enable_hand_model,
                               float *out_mhr_model_params,
                               float *out_shape,
                               float *out_face);

