lighttransport/gemm/common/sam3d_body_decoder.h
/*
 * Stage 12: 70-keypoint regression from mesh + joint coords.
 *
 *   verts:        (V=18439, 3) f32 — pre-camera-flip vertices (cm→m already)
 *   joint_coords: (J=127,   3) f32 — pre-camera-flip joint coords (m)
 *   out_kpts:     (70, 3)     f32 — flipped on (y,z) to camera system
 *
 * keypoint_mapping shape: (308, 18566) where 18566 = V + J. We compute:
 *   K = keypoint_mapping @ cat(verts, joint_coords)   → (308, 3)
 * then take the first 70 rows and flip y,z signs.
 */
int sam3d_body_keypoints_from_mesh(const sam3d_body_decoder_model *m,
                                   const float *verts_m,
                                   const float *joint_coords_m,
                                   int enable_hand_model,
                                   int n_threads,
                                   float *out_kpts);

/*
 * Per-image batch parameters used by camera_project (mirrors the
 * subset of `batch` consumed by PerspectiveHead.perspective_projection
 * and BaseModel._full_to_crop). All in original-image coords unless
 * noted; row-major.
 */
typedef struct {
    float cam_int[9];           /* (3,3) intrinsic matrix */
    float bbox_center[2];       /* upstream `batch["bbox_center"]` row */
    float bbox_scale;           /* upstream `batch["bbox_scale"][..., 0]` */
    float ori_img_size[2];      /* original image (W, H) — currently unused
                                 * by perspective_projection but kept for
                                 * symmetry with upstream batch dict */
    float img_size[2];          /* model input (W, H) — used by
                                 * perspective_projection to compute (cx, cy)
                                 * and by _full_to_crop for /img_size − 0.5 */
    float affine_trans[6];      /* (2,3) row-major; full→crop affine */
    int   use_intrin_center;    /* upstream cfg.MODEL.DECODER.USE_INTRIN_CENTER */
    float default_scale_factor; /* PerspectiveHead.default_scale_factor (1.0) */
} sam3d_body_camera_batch;

/*
 * Apply PerspectiveHead.perspective_projection (cam_t scale-translate
 * + j3d_cam = j3d + cam_t + project via cam_int) followed by
 * BaseModel._full_to_crop on the projected 2D points.
 *
 *   j3d_post_flip:    (K, 3) f32 — pred_keypoints_3d from MHRHead
 *                     (already y/z flipped to camera system); pre-cam_t.
 *   pred_cam:         (3,)   f32 — head_camera output + init_camera =
 *                     (s, tx, ty); function applies the (-1, +1, -1)
 *                     channel flip internally before use.
 *   batch:            per-image batch params.
 *   K:                number of keypoints (70 for body).
 *   out_kp2d:         (K, 2) f32 — 2D in original-image coords (output
 *                     of perspective_projection before _full_to_crop).
 *   out_kp2d_cropped: (K, 2) f32 — _full_to_crop output, in [-0.5, 0.5].
 *   out_kp2d_depth:   (K,)   f32 — z component of (j3d + cam_t).
 *   out_pred_cam_t:   (3,)   f32 — final camera translation [tx+cx, ty+cy, tz].
 *
 * Any of the four out pointers may be NULL to skip that output.
 */
int sam3d_body_camera_project(const float *j3d_post_flip,
                              const float *pred_cam,
                              const sam3d_body_camera_batch *batch,
                              int K,
                              float *out_kp2d,
                              float *out_kp2d_cropped,
                              float *out_kp2d_depth,
                              float *out_pred_cam_t);

/*
 * Forward decl of MHR assets (full definition in sam3d_body_mhr.h).
 * Callers of sam3d_body_decoder_forward_full must include sam3d_body_mhr.h
 * and ensure SAM3D_BODY_MHR_IMPLEMENTATION is defined in some TU so the
 * symbol `sam3d_body_mhr_forward` is linked.
 */
struct sam3d_body_mhr_assets_t;

typedef struct {
    /* Final regression outputs (post add_init). */
    float mhr_params[519];
    float cam_t[3];                /* head_camera output + init_camera (s,tx,ty) */
    /* Final 70-keypoint outputs (cam frame, post-flip; 2D in orig-image coords). */
    float pred_keypoints_3d[70 * 3];        /* m, post-flip cam frame */
    float pred_keypoints_2d[70 * 2];        /* original-image (W,H) px */
    float pred_keypoints_2d_cropped[70 * 2];/* crop, in [-0.5, 0.5] */
    float pred_keypoints_2d_depth[70];       /* z component (m) */
    float pred_cam_t_world[3];               /* (tx+cx, ty+cy, tz) */
    /* Optional caller-allocated buffers (NULL OK to skip). */
    float *pred_vertices;          /* (V*3,) post-flip cam frame; V=18439, m */
    float *mhr_model_params;       /* (204,) */
    float *shape;                  /* (45,) */
    float *face;                   /* (72,) */
    float *global_skel;            /* (J*8,) pre-flip cm; J=127 */
    /* Optional per-layer (li=0..n_layers-1) debug dumps; each should point
     * to (n_layers * <size>) floats or be NULL. Only intermediate layers
     * 0..n_layers-2 are written (final layer skips MHR-in-loop). */
    float *dbg_layer_kp3d;          /* (n_layers, 70, 3) post-flip m */
    float *dbg_layer_kp2d_crop;     /* (n_layers, 70, 2) */
    float *dbg_layer_kp2d_depth;    /* (n_layers, 70) */
    float *dbg_layer_cam_t;         /* (n_layers, 3) cam_t (tx+cx, ty+cy, tz) */
    float *dbg_layer_tokens_out;    /* (n_layers, N_Q, D) post-decoder_layer, pre-kp_update */
    float *dbg_layer_pose_raw;      /* (n_layers, 519) raw head_pose.proj at intermediate */
} sam3d_body_decoder_full_result;

/*
 * Iterative end-to-end decoder forward (production path; no preset MHR
 * intermediates). Mirrors meta_arch.sam3d_body.forward_decoder + the
 * 6-iteration body branch of MHRHead.forward.
 *
 * Per layer (layer < n_layers-1):
 *   tokens       = decoder_layer_forward(tokens, x_pe, image_emb, image_pe)
 *   tokens_norm  = norm_final(tokens)
 *   pose_raw,cam = apply_heads_raw(tokens_norm[0])
 *   model_params = decode_pose_raw(pose_raw + init_pose)
 *   verts_cm,gskel_cm = mhr_forward(model_params, shape, face)
 *   kp3d_m       = keypoints_from_mesh(verts_cm/100, gskel_cm[:,0:3]/100)
 *   kp2d_*       = camera_project(kp3d_m, cam + init_camera)
 *   tokens,x_pe  = kp_token_update(tokens, x_pe, kp2d_cropped, kp2d_depth, kp3d_m)
 *
 * Final layer skips kp_token_update; final pose_token feeds final
 * apply_heads_raw + MHR forward + keypoints_from_mesh + camera_project,
 * populating `out`.
 *
 *   image_emb_chw (kv_dim, H, W) post-ray_cond.
 *   image_pe_chw  (kv_dim, H, W) image PE.
 *   initial_tokens (145, 1024) from build_tokens.
 *   initial_augment (145, 1024) from build_tokens.
 */
int sam3d_body_decoder_forward_full(
    const sam3d_body_decoder_model *m,
    const struct sam3d_body_mhr_assets_t *mhr,
    const sam3d_body_camera_batch *cam_batch,
    const float *image_emb_chw,
    const float *image_pe_chw,
    int H, int W,
    const float *initial_tokens,
    const float *initial_augment,
    int n_threads,
    sam3d_body_decoder_full_result *out);

