lighttransport/gemm/common/sam3d_body_decoder.h
/*
 * sam3d_body_decoder_forward — self-driven body-branch entry point.
 *
 * Bundles the four assembly steps (ray_cond_emb + get_dense_pe +
 * compute_condition_info + build_tokens) and delegates to
 * sam3d_body_decoder_forward_full. Identical math to the iterative path
 * sam3d_body_runner.c uses, packaged so callers that already have raw
 * DINOv3 patch tokens + a camera_batch can skip the runner glue.
 *
 *   image_tokens_patch: (H*W, kv_dim=1280) f32 — DINOv3 patch tokens with
 *                       CLS + register tokens already stripped.
 *   H, W:               patch grid (32×32 for dinov3, 24×32 for vith).
 *   rays_hwc:           (H, W, 3) f32 — (dx, dy, 1) per spatial after the
 *                       encoder downsample + z-append.
 *   condition_info:     (3,) f32 — CLIFF-style bbox/cam encoding.
 *
 * Defined when SAM3D_BODY_DECODER_FULL_IMPLEMENTATION is set.
 * out->pred_vertices / mhr_model_params / shape / face / global_skel /
 * dbg_layer_* may be set by the caller; NULL skips them.
 */
int sam3d_body_decoder_forward(
    const sam3d_body_decoder_model *m,
    const struct sam3d_body_mhr_assets_t *mhr,
    const sam3d_body_camera_batch *cam_batch,
    const float *image_tokens_patch,
    int H, int W,
    const float *rays_hwc,
    const float *condition_info,
    int n_threads,
    sam3d_body_decoder_full_result *out);

#ifdef __cplusplus
}
#endif

/* ==================================================================== */
#ifdef SAM3D_BODY_DECODER_IMPLEMENTATION

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#ifndef SAFETENSORS_IMPLEMENTATION
#define SAFETENSORS_IMPLEMENTATION 1
#endif
#include "safetensors.h"

/* MHR API (no impl) — needed by sam3d_body_decoder_forward_full, which
 * is gated behind SAM3D_BODY_DECODER_FULL_IMPLEMENTATION so consumers that
 * don't need the MHR-in-the-loop path don't pull `sam3d_body_mhr_forward`
 * into the link. The caller TU must define both
 * SAM3D_BODY_DECODER_FULL_IMPLEMENTATION and SAM3D_BODY_MHR_IMPLEMENTATION. */
#ifdef SAM3D_BODY_DECODER_FULL_IMPLEMENTATION
#include "sam3d_body_mhr.h"
#endif

static int s3db_find_f32(st_context *st, const char *name, qtensor *out)
{
    int i = safetensors_find(st, name);
    if (i < 0) return -1;
    const char *dt = safetensors_dtype(st, i);
    if (strcmp(dt, "F32") != 0) {
        fprintf(stderr, "sam3d_body_decoder: %s unexpected dtype %s (want F32)\n",
                name, dt);
        return -1;
    }
    out->data = (void *)safetensors_data(st, i);
    out->type = 1 /* FP32 */;
    int nd = safetensors_ndims(st, i);
    const uint64_t *shape = safetensors_shape(st, i);
    out->n_dims = nd;
    for (int d = 0; d < nd && d < 4; d++) out->dims[d] = shape[d];
    out->n_rows = (nd >= 1) ? (int)out->dims[0] : 1;
    out->n_cols = (nd >= 2) ? (int)out->dims[1] : 1;
    return 0;
}

/* Small wrapper that records the key but doesn't error on missing. */
static int s3db_find_f32_opt(st_context *st, const char *name, qtensor *out)
{
    int i = safetensors_find(st, name);
    if (i < 0) { memset(out, 0, sizeof(*out)); return -1; }
    return s3db_find_f32(st, name, out);
}

static int s3db_find_i64(st_context *st, const char *name, qtensor *out)
{
    int i = safetensors_find(st, name);
    if (i < 0) return -1;
    const char *dt = safetensors_dtype(st, i);
    if (strcmp(dt, "I64") != 0) {
        fprintf(stderr, "sam3d_body_decoder: %s unexpected dtype %s (want I64)\n",
                name, dt);
        return -1;
    }
    out->data = (void *)safetensors_data(st, i);
    out->type = 0 /* not a quant type; raw int */;
    int nd = safetensors_ndims(st, i);
    const uint64_t *shape = safetensors_shape(st, i);
    out->n_dims = nd;
    for (int d = 0; d < nd && d < 4; d++) out->dims[d] = shape[d];
    out->n_rows = (nd >= 1) ? (int)out->dims[0] : 1;
    out->n_cols = (nd >= 2) ? (int)out->dims[1] : 1;
    return 0;
}

sam3d_body_decoder_model *sam3d_body_decoder_load(const char *decoder_sft,
                                                  const char *mhr_head_sft)
{
    if (!decoder_sft || !mhr_head_sft) return NULL;

    sam3d_body_decoder_model *m =
        (sam3d_body_decoder_model *)calloc(1, sizeof(*m));
    if (!m) return NULL;

    m->n_layers = 6;
    m->dim = 1024;
    m->kv_dim = 1280;
    m->n_heads = 8;
    m->head_dim = 64;
    m->ffn_hidden = 1024;
    m->n_keypoints = 70;
    m->n_hand_tokens = 2;
    m->npose = 519;
    m->ncam = 3;
    m->cond_dim = 3;
    m->kp_sample_scale_x = (strstr(decoder_sft, "vith") != NULL);
    m->ln_eps = 1e-6f;

    st_context *dec = safetensors_open(decoder_sft);
    st_context *mhr = safetensors_open(mhr_head_sft);
    if (!dec || !mhr) {
        fprintf(stderr, "sam3d_body_decoder: safetensors_open failed (dec=%p mhr=%p)\n",
                (void *)dec, (void *)mhr);
        if (dec) safetensors_close(dec);
        if (mhr) safetensors_close(mhr);
        free(m);
        return NULL;
    }
    m->_st_decoder = dec;
    m->_st_mhr_head = mhr;

    /* Per-layer weights are loaded in later substeps (4d..4g). The
     * ray_cond sub-module (step 4c) is loaded eagerly since it's the
     * first callable stage. */
    m->layers = (sam3d_body_decoder_layer *)calloc((size_t)m->n_layers,
                                                   sizeof(*m->layers));
    if (!m->layers) { sam3d_body_decoder_free(m); return NULL; }

    int bad = 0;
    bad |= s3db_find_f32(dec, "ray_cond_emb.conv.weight", &m->ray_cond_conv_w);
    bad |= s3db_find_f32(dec, "ray_cond_emb.norm.weight", &m->ray_cond_norm_w);
    bad |= s3db_find_f32(dec, "ray_cond_emb.norm.bias",   &m->ray_cond_norm_b);
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: ray_cond_emb weights missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }
    /* conv has bias=False — leave ray_cond_conv_b zeroed. */

    /* ---- Token-construction weights (step 4d). ---- */
    bad  = s3db_find_f32(dec, "init_to_token_mhr.weight",  &m->init_to_token_w);
    bad |= s3db_find_f32(dec, "init_to_token_mhr.bias",    &m->init_to_token_b);
    bad |= s3db_find_f32(dec, "prev_to_token_mhr.weight",  &m->prev_to_token_w);
    bad |= s3db_find_f32(dec, "prev_to_token_mhr.bias",    &m->prev_to_token_b);
    bad |= s3db_find_f32(dec, "prompt_to_token.weight",    &m->prompt_to_token_w);
    bad |= s3db_find_f32(dec, "prompt_to_token.bias",      &m->prompt_to_token_b);
    bad |= s3db_find_f32(dec, "keypoint_embedding.weight",   &m->keypoint_embedding);
    bad |= s3db_find_f32(dec, "keypoint3d_embedding.weight", &m->keypoint3d_embedding);
    bad |= s3db_find_f32(dec, "hand_box_embedding.weight",   &m->hand_box_embedding);
    bad |= s3db_find_f32(dec, "prompt_encoder.pe_layer.positional_encoding_gaussian_matrix",
                        &m->prompt_pe_gauss);
    bad |= s3db_find_f32(dec, "prompt_encoder.invalid_point_embed.weight",
                        &m->invalid_point_embed);
    bad |= s3db_find_f32(dec, "prompt_encoder.no_mask_embed.weight",
                        &m->no_mask_embed);
    /* hand_pe is optional in v1 body-only path. */
    s3db_find_f32_opt(dec, "hand_pe_layer.positional_encoding_gaussian_matrix",
                      &m->hand_pe_gauss);
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: token-construction weights missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }

