lighttransport/gemm/common/sam3d_body_decoder.h
    /* ---- Keypoint-token update weights (step 4f, used by per-layer
     *      keypoint_token_update_fn). ---- */
    bad  = s3db_find_f32(dec, "keypoint_feat_linear.weight",                &m->kp_feat_linear_w);
    bad |= s3db_find_f32(dec, "keypoint_feat_linear.bias",                  &m->kp_feat_linear_b);
    bad |= s3db_find_f32(dec, "keypoint_posemb_linear.layers.0.0.weight",   &m->kp_posemb_l0_w);
    bad |= s3db_find_f32(dec, "keypoint_posemb_linear.layers.0.0.bias",     &m->kp_posemb_l0_b);
    bad |= s3db_find_f32(dec, "keypoint_posemb_linear.layers.1.weight",     &m->kp_posemb_l1_w);
    bad |= s3db_find_f32(dec, "keypoint_posemb_linear.layers.1.bias",       &m->kp_posemb_l1_b);
    bad |= s3db_find_f32(dec, "keypoint3d_posemb_linear.layers.0.0.weight", &m->kp3d_posemb_l0_w);
    bad |= s3db_find_f32(dec, "keypoint3d_posemb_linear.layers.0.0.bias",   &m->kp3d_posemb_l0_b);
    bad |= s3db_find_f32(dec, "keypoint3d_posemb_linear.layers.1.weight",   &m->kp3d_posemb_l1_w);
    bad |= s3db_find_f32(dec, "keypoint3d_posemb_linear.layers.1.bias",     &m->kp3d_posemb_l1_b);
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: kp-token-update weights missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }

    /* ---- Per-layer TransformerDecoderLayer weights (step 4e). ---- */
    for (int li = 0; li < m->n_layers; li++) {
        sam3d_body_decoder_layer *L = &m->layers[li];
        char p[192];
#define FIND_LN(prefix, fld_w, fld_b)                                                  \
        do {                                                                           \
            snprintf(p, sizeof(p), "decoder.layers.%d." prefix ".weight", li);         \
            if (s3db_find_f32(dec, p, &L->fld_w)) { bad = 1; break; }                  \
            snprintf(p, sizeof(p), "decoder.layers.%d." prefix ".bias", li);           \
            if (s3db_find_f32(dec, p, &L->fld_b)) { bad = 1; break; }                  \
        } while (0)
#define FIND_PROJ(prefix, fld_w, fld_b)                                                \
        do {                                                                           \
            snprintf(p, sizeof(p), "decoder.layers.%d." prefix ".weight", li);         \
            if (s3db_find_f32(dec, p, &L->fld_w)) { bad = 1; break; }                  \
            snprintf(p, sizeof(p), "decoder.layers.%d." prefix ".bias", li);           \
            if (s3db_find_f32(dec, p, &L->fld_b)) { bad = 1; break; }                  \
        } while (0)

        FIND_LN("ln1",     ln1_w,     ln1_b);
        FIND_LN("ln_pe_1", ln_pe_1_w, ln_pe_1_b);
        FIND_LN("ln2_1",   ln2_1_w,   ln2_1_b);
        FIND_LN("ln2_2",   ln2_2_w,   ln2_2_b);
        FIND_LN("ln_pe_2", ln_pe_2_w, ln_pe_2_b);
        FIND_LN("ln3",     ln3_w,     ln3_b);

        FIND_PROJ("self_attn.q_proj",  sa_q_w,    sa_q_b);
        FIND_PROJ("self_attn.k_proj",  sa_k_w,    sa_k_b);
        FIND_PROJ("self_attn.v_proj",  sa_v_w,    sa_v_b);
        FIND_PROJ("self_attn.proj",    sa_proj_w, sa_proj_b);

        FIND_PROJ("cross_attn.q_proj", ca_q_w,    ca_q_b);
        FIND_PROJ("cross_attn.k_proj", ca_k_w,    ca_k_b);
        FIND_PROJ("cross_attn.v_proj", ca_v_w,    ca_v_b);
        FIND_PROJ("cross_attn.proj",   ca_proj_w, ca_proj_b);

        FIND_PROJ("ffn.layers.0.0", ffn0_w, ffn0_b);
        FIND_PROJ("ffn.layers.1",   ffn1_w, ffn1_b);
#undef FIND_LN
#undef FIND_PROJ
        if (bad) break;
    }
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: per-layer weights missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }

    /* Final LN on tokens after last layer. */
    bad  = s3db_find_f32(dec, "decoder.norm_final.weight", &m->norm_final_w);
    bad |= s3db_find_f32(dec, "decoder.norm_final.bias",   &m->norm_final_b);
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: decoder.norm_final weights missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }

    /* ---- MHR head regression weights (step 4f). ---- */
    bad  = s3db_find_f32(mhr, "head_pose.proj.layers.0.0.weight", &m->head_pose_l0_w);
    bad |= s3db_find_f32(mhr, "head_pose.proj.layers.0.0.bias",   &m->head_pose_l0_b);
    bad |= s3db_find_f32(mhr, "head_pose.proj.layers.1.weight",   &m->head_pose_l1_w);
    bad |= s3db_find_f32(mhr, "head_pose.proj.layers.1.bias",     &m->head_pose_l1_b);
    bad |= s3db_find_f32(mhr, "head_camera.proj.layers.0.0.weight", &m->head_camera_l0_w);
    bad |= s3db_find_f32(mhr, "head_camera.proj.layers.0.0.bias",   &m->head_camera_l0_b);
    bad |= s3db_find_f32(mhr, "head_camera.proj.layers.1.weight",   &m->head_camera_l1_w);
    bad |= s3db_find_f32(mhr, "head_camera.proj.layers.1.bias",     &m->head_camera_l1_b);
    bad |= s3db_find_f32(mhr, "init_pose.weight",   &m->init_pose);
    bad |= s3db_find_f32(mhr, "init_camera.weight", &m->init_camera);
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: MHR head regression weights missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }

    /* MHR head PCA + keypoint assets (stages 1-5 + 12). */
    bad  = s3db_find_f32(mhr, "head_pose.scale_mean",       &m->scale_mean);
    bad |= s3db_find_f32(mhr, "head_pose.scale_comps",      &m->scale_comps);
    bad |= s3db_find_f32(mhr, "head_pose.hand_pose_mean",   &m->hand_pose_mean);
    bad |= s3db_find_f32(mhr, "head_pose.hand_pose_comps",  &m->hand_pose_comps);
    bad |= s3db_find_i64(mhr, "head_pose.hand_joint_idxs_left",  &m->hand_idx_left);
    bad |= s3db_find_i64(mhr, "head_pose.hand_joint_idxs_right", &m->hand_idx_right);
    bad |= s3db_find_f32(mhr, "head_pose.keypoint_mapping", &m->keypoint_mapping);
    bad |= s3db_find_f32(mhr, "head_pose.local_to_world_wrist", &m->local_to_world_wrist);
    bad |= s3db_find_f32(mhr, "head_pose.right_wrist_coords",   &m->right_wrist_coords);
    bad |= s3db_find_f32(mhr, "head_pose.root_coords",          &m->root_coords);
    bad |= s3db_find_i64(mhr, "head_pose.nonhand_param_idxs",   &m->nonhand_param_idxs);
    bad |= s3db_find_i64(mhr, "head_pose.faces",                &m->faces);
    if (bad) {
        fprintf(stderr, "sam3d_body_decoder: MHR head PCA/keypoint assets missing\n");
        sam3d_body_decoder_free(m);
        return NULL;
    }

