lighttransport/gemm/common/sam3d_body_decoder.h
    fprintf(stderr, "sam3d_body_decoder: loaded "
                    "(decoder=%s mhr_head=%s) — ray_cond_emb + tokens + "
                    "%d layers + norm_final + MHR regression heads ready\n",
            decoder_sft, mhr_head_sft, m->n_layers);
    return m;
}

void sam3d_body_decoder_free(sam3d_body_decoder_model *m)
{
    if (!m) return;
    if (m->_st_decoder) safetensors_close((st_context *)m->_st_decoder);
    if (m->_st_mhr_head) safetensors_close((st_context *)m->_st_mhr_head);
    free(m->layers);
    free(m);
}

/* ---- ray_cond_emb forward (step 4c) ------------------------------- */

#include <math.h>

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

/* Fills `out` (N_fourier = 3 + 2*3*num_bands = 99) per spatial position.
 * Bands: linspace(1, max_res/2=32, 16). Layout per position:
 *   [pos_x, pos_y, pos_z,
 *    sin(π·x·b0..15), sin(π·y·b0..15), sin(π·z·b0..15),
 *    cos(π·x·b0..15), cos(π·y·b0..15), cos(π·z·b0..15)]  — matches upstream
 */
static void s3db_fourier_pos_encoding(const float *rays_xyz,
                                      int H, int W, int num_bands,
                                      float *out /* (H*W, 3 + 6*num_bands) */)
{
    const int dim_out = 3 + 2 * 3 * num_bands;
    const int N = H * W;
    /* Linear frequency band table: start=1, end=max_res/2=32. */
    float bands[32]; /* up to 32 bands — more than enough for num_bands=16 */
    const float end = 32.0f;
    for (int b = 0; b < num_bands; b++) {
        bands[b] = (num_bands == 1) ? 1.0f
                                    : 1.0f + (end - 1.0f) * (float)b / (float)(num_bands - 1);
    }
    for (int n = 0; n < N; n++) {
        const float *p = rays_xyz + (size_t)n * 3;
        float *o = out + (size_t)n * dim_out;
        o[0] = p[0]; o[1] = p[1]; o[2] = p[2];
        /* 48 product values: axis-major then band-major. */
        float products[48];
        for (int a = 0; a < 3; a++)
            for (int b = 0; b < num_bands; b++)
                products[a * num_bands + b] = p[a] * bands[b];
        float *sinv = o + 3;
        float *cosv = o + 3 + 3 * num_bands;
        for (int i = 0; i < 3 * num_bands; i++) {
            float v = (float)M_PI * products[i];
            sinv[i] = sinf(v);
            cosv[i] = cosf(v);
        }
    }
}

/* 1×1 conv ≡ matmul: out[c, n] = Σ_i W[c, i] * src[i, n].
 * Source layout: (C_in, N). Dest layout: (C_out, N). Weight: (C_out, C_in).
 * Parallelized over C_out. */
static void s3db_conv1x1_f32(const float *W, const float *src,
                             int C_out, int C_in, int N,
                             float *dst, int n_threads)
{
    (void)n_threads;
    #if defined(_OPENMP)
    #pragma omp parallel for schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int c = 0; c < C_out; c++) {
        const float *wrow = W + (size_t)c * C_in;
        float *drow = dst + (size_t)c * N;
        for (int n = 0; n < N; n++) {
            double acc = 0.0;
            for (int i = 0; i < C_in; i++)
                acc += (double)wrow[i] * (double)src[(size_t)i * N + n];
            drow[n] = (float)acc;
        }
    }
}

/* LayerNorm2d (upstream custom): per-spatial over channels, (C,) gamma/beta.
 * in/out layout: (C, H*W). */
static void s3db_layer_norm2d(float *dst, const float *src,
                              const float *gamma, const float *beta,
                              int C, int N, float eps, int n_threads)
{
    (void)n_threads;
    #if defined(_OPENMP)
    #pragma omp parallel for schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int n = 0; n < N; n++) {
        /* mean along C at this spatial pos. Non-contiguous: stride N. */
        double sum = 0.0;
        for (int c = 0; c < C; c++) sum += (double)src[(size_t)c * N + n];
        float mean = (float)(sum / (double)C);
        double var = 0.0;
        for (int c = 0; c < C; c++) {
            float d = src[(size_t)c * N + n] - mean;
            var += (double)d * (double)d;
        }
        float inv = 1.0f / sqrtf((float)(var / (double)C) + eps);
        for (int c = 0; c < C; c++) {
            float v = (src[(size_t)c * N + n] - mean) * inv;
            dst[(size_t)c * N + n] = v * gamma[c] + beta[c];
        }
    }
}

int sam3d_body_ray_cond_emb_forward(const sam3d_body_decoder_model *m,
                                    const float *image_emb,
                                    const float *rays_xyz,
                                    int H, int W,
                                    int n_threads,
                                    float *out)
{
    if (!m || !image_emb || !rays_xyz || !out) return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->ray_cond_conv_w.data) return SAM3D_BODY_DECODER_E_LOAD;
    const int C_img = m->kv_dim;          /* 1280 */
    const int num_bands = 16;
    const int C_fp = 3 + 2 * 3 * num_bands; /* 99 */
    const int C_in = C_img + C_fp;        /* 1379 */
    const int N = H * W;

    /* 1. Fourier features: (N, 99) */
    float *fp_packed = (float *)malloc((size_t)N * (size_t)C_fp * sizeof(float));
    if (!fp_packed) return SAM3D_BODY_DECODER_E_LOAD;
    s3db_fourier_pos_encoding(rays_xyz, H, W, num_bands, fp_packed);

    /* 2. Transpose fourier to (C_fp, N). */
    float *fp = (float *)malloc((size_t)C_fp * (size_t)N * sizeof(float));
    if (!fp) { free(fp_packed); return SAM3D_BODY_DECODER_E_LOAD; }
    for (int n = 0; n < N; n++)
        for (int c = 0; c < C_fp; c++)
            fp[(size_t)c * N + n] = fp_packed[(size_t)n * C_fp + c];
    free(fp_packed);

    /* 3. Concat along C: preconv = [image_emb (C_img, N); fp (C_fp, N)] */
    float *preconv = (float *)malloc((size_t)C_in * (size_t)N * sizeof(float));
    if (!preconv) { free(fp); return SAM3D_BODY_DECODER_E_LOAD; }
    memcpy(preconv,
           image_emb,
           (size_t)C_img * (size_t)N * sizeof(float));
    memcpy(preconv + (size_t)C_img * N,
           fp,
           (size_t)C_fp  * (size_t)N * sizeof(float));
    free(fp);

    /* 4. 1×1 conv (no bias). W is (C_img, C_in). */
    float *postconv = (float *)malloc((size_t)C_img * (size_t)N * sizeof(float));
    if (!postconv) { free(preconv); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_conv1x1_f32((const float *)m->ray_cond_conv_w.data,
                     preconv, C_img, C_in, N, postconv, n_threads);
    free(preconv);

    /* 5. LayerNorm2d with learnable gamma/beta. */
    s3db_layer_norm2d(out, postconv,
                      (const float *)m->ray_cond_norm_w.data,
                      (const float *)m->ray_cond_norm_b.data,
                      C_img, N, m->ln_eps, n_threads);
    free(postconv);
    return SAM3D_BODY_DECODER_E_OK;
}

/* ---- SAM PE get_dense_pe + invalid prompt (step 8c-ii) ----------- */

int sam3d_body_get_dense_pe(const sam3d_body_decoder_model *m,
                            int H, int W, int n_threads, float *out)
{
    if (!m || !out || H <= 0 || W <= 0) return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->prompt_pe_gauss.data) return SAM3D_BODY_DECODER_E_LOAD;
    /* gaussian_matrix is (2, num_pos_feats); embed_dim = 2 * num_pos_feats. */
    const int npf = (int)m->prompt_pe_gauss.dims[1];
    const float *G = (const float *)m->prompt_pe_gauss.data; /* (2, npf) */

    (void)n_threads;
    #if defined(_OPENMP)
    #pragma omp parallel for schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int yi = 0; yi < H; yi++) {
        const float yn = ((float)yi + 0.5f) / (float)H;        /* [0,1] */
        const float ys = 2.0f * yn - 1.0f;                     /* [-1,1] */
        /* ViT-H refs use the post-crop 32x24 grid in the original square
         * crop coordinate frame. DINOv3 rectangular refs use normal HxW grid
         * normalization. */
        const float x_offset = (m->kp_sample_scale_x && W != H)
            ? 0.5f * (float)(H - W) : 0.0f;
        for (int xi = 0; xi < W; xi++) {
            const float xn = (m->kp_sample_scale_x && W != H)
                ? ((float)xi + x_offset + 0.5f) / (float)H
                : ((float)xi + 0.5f) / (float)W;
            const float xs = 2.0f * xn - 1.0f;
            const float two_pi = 6.2831853071795864769f;
            for (int k = 0; k < npf; k++) {
                /* coords @ G  →  xs*G[0,k] + ys*G[1,k] */
                float v = xs * G[0 * npf + k] + ys * G[1 * npf + k];
                v *= two_pi;
                float s = sinf(v), c = cosf(v);
                /* CHW: out[k, yi, xi]  and out[npf+k, yi, xi]. */
                out[((size_t)k         * H + yi) * W + xi] = s;
                out[((size_t)(npf + k) * H + yi) * W + xi] = c;
            }
        }
    }
    return SAM3D_BODY_DECODER_E_OK;
}

int sam3d_body_invalid_prompt_token(const sam3d_body_decoder_model *m,
                                    float *out)
{
    if (!m || !out) return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->invalid_point_embed.data) return SAM3D_BODY_DECODER_E_LOAD;
    const int D = m->kv_dim;  /* 1280 */
    /* Single dummy keypoint with label==-2: _pe_encoding output is
     * zeroed and overwritten with invalid_point_embed.weight (1, 1280). */
    memcpy(out, m->invalid_point_embed.data, (size_t)D * sizeof(float));
    return SAM3D_BODY_DECODER_E_OK;
}

/* ---- ray_cond builder (step 8c-ii) -------------------------------- */

