lighttransport/gemm/common/sam3d_body_decoder.h
/* 1D antialias-bilinear downsample (separable triangle filter).
 *
 * For a downsampling factor s = N_in / N_out > 1:
 *   - support = max(s, 1)
 *   - per output i_out: center = (i_out + 0.5) * s - 0.5
 *     window (input coords) = [center - support, center + support]
 *     weight w(j) = max(0, 1 - |center - j| / support) (triangle)
 *     out[i_out] = Σ_j w(j) * in[j] / Σ_j w(j)   (boundary clipping
 *                                                 sums over j ∈ [0, N_in))
 *
 * Mirrors aten/src/ATen/native/UpSample{Bilinear2d}.cpp antialias kernel.
 */
static void s3db_antialias_downsample_1d(const float *in, int N_in,
                                         float *out, int N_out)
{
    const double scale = (double)N_in / (double)N_out;
    const double support = (scale > 1.0) ? scale : 1.0;
    const double inv_support = 1.0 / support;

    for (int i_out = 0; i_out < N_out; i_out++) {
        const double center = ((double)i_out + 0.5) * scale - 0.5;
        int j_min = (int)floor(center - support + 1e-9);
        int j_max = (int)floor(center + support - 1e-9);
        if (j_min < 0) j_min = 0;
        if (j_max >= N_in) j_max = N_in - 1;

        double sum_w = 0.0, sum_wf = 0.0;
        for (int j = j_min; j <= j_max; j++) {
            double dist = fabs(center - (double)j) * inv_support;
            double w = 1.0 - dist;
            if (w <= 0.0) continue;
            sum_w  += w;
            sum_wf += w * (double)in[j];
        }
        out[i_out] = (sum_w > 0.0) ? (float)(sum_wf / sum_w) : 0.0f;
    }
}

int sam3d_body_compute_ray_cond_xyz(const float *cam_int,
                                    const float *affine_trans,
                                    int H_in, int W_in,
                                    int H_out, int W_out,
                                    float *out)
{
    return sam3d_body_compute_ray_cond_xyz_ex(cam_int, affine_trans,
                                              H_in, W_in, H_out, W_out,
                                              0, out);
}

int sam3d_body_compute_ray_cond_xyz_ex(const float *cam_int,
                                       const float *affine_trans,
                                       int H_in, int W_in,
                                       int H_out, int W_out,
                                       int dinov3_rect_reinterpret,
                                       float *out)
{
    if (!cam_int || !affine_trans || !out) return SAM3D_BODY_DECODER_E_INVAL;
    if (H_in <= 0 || W_in <= 0 || H_out <= 0 || W_out <= 0)
        return SAM3D_BODY_DECODER_E_INVAL;

    const float fx = cam_int[0 * 3 + 0];
    const float fy = cam_int[1 * 3 + 1];
    const float cx = cam_int[0 * 3 + 2];
    const float cy = cam_int[1 * 3 + 2];

    const float a00 = affine_trans[0 * 3 + 0];
    const float a11 = affine_trans[1 * 3 + 1];
    const float t02 = affine_trans[0 * 3 + 2];
    const float t12 = affine_trans[1 * 3 + 2];

    if (dinov3_rect_reinterpret && H_in != W_in && H_out != W_out) {
        float *x_full = (float *)malloc((size_t)H_in * sizeof(float));
        float *y_full = (float *)malloc((size_t)W_in * sizeof(float));
        if (!x_full || !y_full) {
            free(x_full); free(y_full);
            return SAM3D_BODY_DECODER_E_LOAD;
        }
        const double inv_a00 = 1.0 / (double)a00;
        const double inv_a11 = 1.0 / (double)a11;
        const double inv_fx  = 1.0 / (double)fx;
        const double inv_fy  = 1.0 / (double)fy;
        for (int j = 0; j < H_in; j++) {
            double xp = (double)j * inv_a00 - (double)t02 * inv_a00;
            x_full[j] = (float)((xp - (double)cx) * inv_fx);
        }
        for (int i = 0; i < W_in; i++) {
            double yp = (double)i * inv_a11 - (double)t12 * inv_a11;
            y_full[i] = (float)((yp - (double)cy) * inv_fy);
        }

        float *x_ds = (float *)malloc((size_t)H_out * sizeof(float));
        float *y_ds = (float *)malloc((size_t)W_out * sizeof(float));
        if (!x_ds || !y_ds) {
            free(x_full); free(y_full); free(x_ds); free(y_ds);
            return SAM3D_BODY_DECODER_E_LOAD;
        }
        s3db_antialias_downsample_1d(x_full, H_in, x_ds, H_out);
        s3db_antialias_downsample_1d(y_full, W_in, y_ds, W_out);
        free(x_full); free(y_full);

        const int tmp_w = H_out;
        for (int yi = 0; yi < H_out; yi++) {
            for (int xi = 0; xi < W_out; xi++) {
                const int k = yi * W_out + xi;
                const int tmp_y = k / tmp_w;
                const int tmp_x = k - tmp_y * tmp_w;
                size_t base = ((size_t)yi * W_out + xi) * 3;
                out[base + 0] = x_ds[tmp_x];
                out[base + 1] = y_ds[tmp_y];
                out[base + 2] = 1.0f;
            }
        }
        free(x_ds); free(y_ds);
        return SAM3D_BODY_DECODER_E_OK;
    }

    /* x_full[j] = (j/a00 - t02/a00 - cx) / fx,  j in [0, W_in)
     * y_full[i] = (i/a11 - t12/a11 - cy) / fy,  i in [0, H_in)
     * Both are linear ramps; apply 1D antialias separately. */
    float *x_full = (float *)malloc((size_t)W_in * sizeof(float));
    float *y_full = (float *)malloc((size_t)H_in * sizeof(float));
    if (!x_full || !y_full) { free(x_full); free(y_full); return SAM3D_BODY_DECODER_E_LOAD; }

    const double inv_a00 = 1.0 / (double)a00;
    const double inv_a11 = 1.0 / (double)a11;
    const double inv_fx  = 1.0 / (double)fx;
    const double inv_fy  = 1.0 / (double)fy;
    for (int j = 0; j < W_in; j++) {
        double xp = (double)j * inv_a00 - (double)t02 * inv_a00;
        x_full[j] = (float)((xp - (double)cx) * inv_fx);
    }
    for (int i = 0; i < H_in; i++) {
        double yp = (double)i * inv_a11 - (double)t12 * inv_a11;
        y_full[i] = (float)((yp - (double)cy) * inv_fy);
    }

    float *x_ds = (float *)malloc((size_t)W_out * sizeof(float));
    float *y_ds = (float *)malloc((size_t)H_out * sizeof(float));
    if (!x_ds || !y_ds) {
        free(x_full); free(y_full); free(x_ds); free(y_ds);
        return SAM3D_BODY_DECODER_E_LOAD;
    }
    const float *x_src = x_full;
    int x_src_n = W_in;
    if (W_in == H_in && W_out != H_out) {
        int crop_w = (int)lrint((double)W_in * (double)W_out / (double)H_out);
        if (crop_w > 0 && crop_w <= W_in) {
            int crop_x0 = (W_in - crop_w) / 2;
            x_src = x_full + crop_x0;
            x_src_n = crop_w;
        }
    }
    s3db_antialias_downsample_1d(x_src, x_src_n, x_ds, W_out);
    s3db_antialias_downsample_1d(y_full, H_in, y_ds, H_out);
    free(x_full); free(y_full);

    /* Pack as (H_out, W_out, 3) with z=1. */
    for (int yi = 0; yi < H_out; yi++) {
        for (int xi = 0; xi < W_out; xi++) {
            size_t base = ((size_t)yi * W_out + xi) * 3;
            out[base + 0] = x_ds[xi];
            out[base + 1] = y_ds[yi];
            out[base + 2] = 1.0f;
        }
    }
    free(x_ds); free(y_ds);
    return SAM3D_BODY_DECODER_E_OK;
}

void sam3d_body_default_cam_int(int W, int H, float *cam_int)
{
    if (!cam_int) return;
    const double f = sqrt((double)W * (double)W + (double)H * (double)H);
    cam_int[0] = (float)f; cam_int[1] = 0.0f;     cam_int[2] = 0.5f * (float)W;
    cam_int[3] = 0.0f;     cam_int[4] = (float)f; cam_int[5] = 0.5f * (float)H;
    cam_int[6] = 0.0f;     cam_int[7] = 0.0f;     cam_int[8] = 1.0f;
}

