lighttransport/gemm/common/sam3d_body_decoder.h
void sam3d_body_fix_aspect_ratio(const float *scale_in, float aspect_ratio,
                                 float *scale_out)
{
    if (!scale_in || !scale_out || aspect_ratio <= 0.0f) return;
    const float sw = scale_in[0], sh = scale_in[1];
    if (sw > sh * aspect_ratio) {
        scale_out[0] = sw;
        scale_out[1] = sw / aspect_ratio;
    } else {
        scale_out[0] = sh * aspect_ratio;
        scale_out[1] = sh;
    }
}

void sam3d_body_get_warp_matrix(const float *center, const float *scale,
                                int out_w, int out_h, float *warp_mat)
{
    if (!center || !scale || !warp_mat) return;
    const float s = (float)out_w / scale[0];
    warp_mat[0] = s;    warp_mat[1] = 0.0f; warp_mat[2] = 0.5f * (float)out_w - center[0] * s;
    warp_mat[3] = 0.0f; warp_mat[4] = s;    warp_mat[5] = 0.5f * (float)out_h - center[1] * s;
}

void sam3d_body_compute_condition_info(const float *bbox_center,
                                       const float *bbox_scale,
                                       const float *ori_img_size,
                                       const float *cam_int,
                                       int use_intrin_center,
                                       float *condition_info)
{
    if (!bbox_center || !bbox_scale || !ori_img_size || !cam_int ||
        !condition_info) return;
    const float f  = cam_int[0];
    const float cx = use_intrin_center ? cam_int[2] : 0.5f * ori_img_size[0];
    const float cy = use_intrin_center ? cam_int[5] : 0.5f * ori_img_size[1];
    condition_info[0] = (bbox_center[0] - cx) / f;
    condition_info[1] = (bbox_center[1] - cy) / f;
    condition_info[2] = bbox_scale[0] / f;
}

void sam3d_body_compute_bbox_affine(const float *bbox_xyxy,
                                    float padding,
                                    float aspect_ratio_pre,
                                    int out_w, int out_h,
                                    float *center,
                                    float *scale,
                                    float *warp_mat)
{
    if (!bbox_xyxy || !center || !scale || !warp_mat) return;
    center[0] = 0.5f * (bbox_xyxy[0] + bbox_xyxy[2]);
    center[1] = 0.5f * (bbox_xyxy[1] + bbox_xyxy[3]);
    float s_raw[2];
    s_raw[0] = (bbox_xyxy[2] - bbox_xyxy[0]) * padding;
    s_raw[1] = (bbox_xyxy[3] - bbox_xyxy[1]) * padding;
    float s1[2] = {0.0f, 0.0f};
    sam3d_body_fix_aspect_ratio(s_raw, aspect_ratio_pre, s1);
    const float ar2 = (out_h > 0) ? ((float)out_w / (float)out_h) : 1.0f;
    sam3d_body_fix_aspect_ratio(s1, ar2, scale);
    sam3d_body_get_warp_matrix(center, scale, out_w, out_h, warp_mat);
}

int sam3d_body_preprocess_image(const uint8_t *img_rgb_hwc,
                                int W_in, int H_in,
                                const float *warp_mat_2x3,
                                int W_out, int H_out,
                                float *out_chw)
{
    if (!img_rgb_hwc || !warp_mat_2x3 || !out_chw) return SAM3D_BODY_DECODER_E_INVAL;
    if (W_in <= 0 || H_in <= 0 || W_out <= 0 || H_out <= 0)
        return SAM3D_BODY_DECODER_E_INVAL;

    /* Invert 2x3 affine (dst->src), matching cv::warpAffine without
     * WARP_INVERSE_MAP. */
    const double a00 = warp_mat_2x3[0], a01 = warp_mat_2x3[1], a02 = warp_mat_2x3[2];
    const double a10 = warp_mat_2x3[3], a11 = warp_mat_2x3[4], a12 = warp_mat_2x3[5];
    const double det = a00 * a11 - a01 * a10;
    if (fabs(det) < 1e-12) return SAM3D_BODY_DECODER_E_INVAL;
    const double inv_det = 1.0 / det;
    const double i00 =  a11 * inv_det;
    const double i01 = -a01 * inv_det;
    const double i02 = (a01 * a12 - a02 * a11) * inv_det;
    const double i10 = -a10 * inv_det;
    const double i11 =  a00 * inv_det;
    const double i12 = (a02 * a10 - a00 * a12) * inv_det;

    const float mean_c[3] = { 0.485f, 0.456f, 0.406f };
    const float std_c [3] = { 0.229f, 0.224f, 0.225f };
    const float inv_std[3] = { 1.0f / std_c[0], 1.0f / std_c[1], 1.0f / std_c[2] };
    const float neg_mean_over_std[3] = {
        -mean_c[0] * inv_std[0],
        -mean_c[1] * inv_std[1],
        -mean_c[2] * inv_std[2],
    };
    const size_t plane = (size_t)H_out * (size_t)W_out;

    /* OpenCV INTER_LINEAR warpAffine uses a fixed-point coordinate path:
     * AB_BITS=10, INTER_BITS=5, plus a half-table-step round_delta before
     * remap. Reproduce that path so DINOv3 raw-image refs are not perturbed
     * by rare 1-2 u8 interpolation differences. For INTER_BITS=5 the
     * 2D interpolation-table coefficients are exact integer multiples of
     * 32 in 15-bit fixed-point, so no table is needed. */
    enum { INTER_BITS_ = 5, INTER_TAB_SIZE_ = 1 << INTER_BITS_ };
    enum { AB_BITS_ = 10, AB_SCALE_ = 1 << AB_BITS_ };
    enum { REMAP_BITS_ = 15, REMAP_SCALE_ = 1 << REMAP_BITS_ };
    const int round_delta = AB_SCALE_ / INTER_TAB_SIZE_ / 2;
    int *adelta = (int *)malloc((size_t)W_out * 2 * sizeof(int));
    if (!adelta) return SAM3D_BODY_DECODER_E_INVAL;
    int *bdelta = adelta + W_out;
    for (int x = 0; x < W_out; x++) {
        adelta[x] = (int)lrint(i00 * (double)x * (double)AB_SCALE_);
        bdelta[x] = (int)lrint(i10 * (double)x * (double)AB_SCALE_);
    }

    for (int y = 0; y < H_out; y++) {
        const int X0 = (int)lrint((i01 * (double)y + i02) *
                                  (double)AB_SCALE_) + round_delta;
        const int Y0 = (int)lrint((i11 * (double)y + i12) *
                                  (double)AB_SCALE_) + round_delta;
        for (int x = 0; x < W_out; x++) {
            const int X = (X0 + adelta[x]) >> (AB_BITS_ - INTER_BITS_);
            const int Y = (Y0 + bdelta[x]) >> (AB_BITS_ - INTER_BITS_);
            const int ix0 = X >> INTER_BITS_;
            const int iy0 = Y >> INTER_BITS_;
            const int ix1 = ix0 + 1;
            const int iy1 = iy0 + 1;
            const int fx = X & (INTER_TAB_SIZE_ - 1);
            const int fy = Y & (INTER_TAB_SIZE_ - 1);
            const int w00 = (INTER_TAB_SIZE_ - fx) * (INTER_TAB_SIZE_ - fy) * 32;
            const int w10 = fx * (INTER_TAB_SIZE_ - fy) * 32;
            const int w01 = (INTER_TAB_SIZE_ - fx) * fy * 32;
            const int w11 = fx * fy * 32;

            const int in00 = (ix0 >= 0 && ix0 < W_in && iy0 >= 0 && iy0 < H_in);
            const int in10 = (ix1 >= 0 && ix1 < W_in && iy0 >= 0 && iy0 < H_in);
            const int in01 = (ix0 >= 0 && ix0 < W_in && iy1 >= 0 && iy1 < H_in);
            const int in11 = (ix1 >= 0 && ix1 < W_in && iy1 >= 0 && iy1 < H_in);

            for (int c = 0; c < 3; c++) {
                int acc = 0;
                if (in00) acc += w00 * (int)img_rgb_hwc[((size_t)iy0 * W_in + ix0) * 3 + c];
                if (in10) acc += w10 * (int)img_rgb_hwc[((size_t)iy0 * W_in + ix1) * 3 + c];
                if (in01) acc += w01 * (int)img_rgb_hwc[((size_t)iy1 * W_in + ix0) * 3 + c];
                if (in11) acc += w11 * (int)img_rgb_hwc[((size_t)iy1 * W_in + ix1) * 3 + c];
                int iv = (acc + (REMAP_SCALE_ >> 1)) >> REMAP_BITS_;
                if (iv < 0) iv = 0; else if (iv > 255) iv = 255;
                const float norm = ((float)iv / 255.0f) * inv_std[c]
                                 + neg_mean_over_std[c];
                out_chw[(size_t)c * plane + (size_t)y * W_out + x] = norm;
            }
        }
    }
    free(adelta);
    return SAM3D_BODY_DECODER_E_OK;
}

/* ---- token construction (step 4d) ---------------------------------- */

/* out[d] = Σ_k W[d,k]*x[k] + b[d]. All f32. */
static void s3db_linear_f32(const float *W, const float *b,
                            const float *x, int D_out, int D_in,
                            float *out)
{
    for (int d = 0; d < D_out; d++) {
        const float *wrow = W + (size_t)d * D_in;
        double acc = b ? (double)b[d] : 0.0;
        for (int k = 0; k < D_in; k++) acc += (double)wrow[k] * (double)x[k];
        out[d] = (float)acc;
    }
}

int sam3d_body_build_tokens(const sam3d_body_decoder_model *m,
                            const float *init_input,
                            const float *prev_input,
                            const float *prompt_in,
                            int n_threads,
                            float *x_out,
                            float *x_pe_out)
{
    (void)n_threads;
    if (!m || !init_input || !prev_input || !prompt_in || !x_out || !x_pe_out)
        return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->init_to_token_w.data || !m->prev_to_token_w.data ||
        !m->prompt_to_token_w.data || !m->keypoint_embedding.data ||
        !m->keypoint3d_embedding.data || !m->hand_box_embedding.data)
        return SAM3D_BODY_DECODER_E_LOAD;

