lighttransport/gemm/common/sam3d_body_decoder.h
    const int D   = m->dim;             /* 1024 */
    const int NKP = m->n_keypoints;     /* 70   */
    const int NHB = m->n_hand_tokens;   /* 2    */
    const int D_init   = m->npose + m->ncam + m->cond_dim;  /* 525 */
    const int D_prev   = m->npose + m->ncam;                /* 522 */
    const int D_prompt = m->kv_dim;                         /* 1280 */
    const int N_tok    = 1 + 1 + 1 + NHB + NKP + NKP;       /* 145 */
    (void)N_tok;

    /* Projections → 3 tokens of dim 1024. */
    float *pose_tok   = x_out + 0 * D;  /* slot 0 */
    float *prev_tok   = x_out + 1 * D;  /* slot 1 */
    float *prompt_tok = x_out + 2 * D;  /* slot 2 */

    s3db_linear_f32((const float *)m->init_to_token_w.data,
                    (const float *)m->init_to_token_b.data,
                    init_input, D, D_init, pose_tok);
    s3db_linear_f32((const float *)m->prev_to_token_w.data,
                    (const float *)m->prev_to_token_b.data,
                    prev_input, D, D_prev, prev_tok);
    s3db_linear_f32((const float *)m->prompt_to_token_w.data,
                    (const float *)m->prompt_to_token_b.data,
                    prompt_in, D, D_prompt, prompt_tok);

    /* Learned embeddings copied in. */
    memcpy(x_out + (1 + 1 + 1) * (size_t)D,
           m->hand_box_embedding.data,
           (size_t)NHB * (size_t)D * sizeof(float));
    memcpy(x_out + (1 + 1 + 1 + NHB) * (size_t)D,
           m->keypoint_embedding.data,
           (size_t)NKP * (size_t)D * sizeof(float));
    memcpy(x_out + (1 + 1 + 1 + NHB + NKP) * (size_t)D,
           m->keypoint3d_embedding.data,
           (size_t)NKP * (size_t)D * sizeof(float));

    /* x_pe (token_augment): zero everywhere except slot 1 (prev) and slot 2 (prompt). */
    memset(x_pe_out, 0, (size_t)(1 + 1 + 1 + NHB + NKP + NKP) * (size_t)D * sizeof(float));
    memcpy(x_pe_out + 1 * (size_t)D, prev_tok,   (size_t)D * sizeof(float));
    memcpy(x_pe_out + 2 * (size_t)D, prompt_tok, (size_t)D * sizeof(float));

    return SAM3D_BODY_DECODER_E_OK;
}

/* ---- TransformerDecoderLayer forward (step 4e) ---------------------- */

/* out[n, d] = b[d] + Σ_k W[d, k] * x[n, k].
 * Inputs: x (N, D_in), W (D_out, D_in), b (D_out) optional. */
static void s3db_linear_batch(float *out, const float *x, const float *W,
                              const float *b, int N, int D_in, int D_out,
                              int n_threads)
{
    #if defined(_OPENMP)
    #pragma omp parallel for collapse(2) schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int n = 0; n < N; n++) {
        for (int d = 0; d < D_out; d++) {
            const float *xrow = x + (size_t)n * D_in;
            const float *wrow = W + (size_t)d * D_in;
            double acc = b ? (double)b[d] : 0.0;
            for (int k = 0; k < D_in; k++) acc += (double)wrow[k] * (double)xrow[k];
            out[(size_t)n * D_out + d] = (float)acc;
        }
    }
}

/* LayerNorm (D channels per row), parallel over rows. */
static void s3db_layer_norm_batch(float *out, const float *x, int N, int D,
                                  const float *gamma, const float *beta, float eps,
                                  int n_threads)
{
    #if defined(_OPENMP)
    #pragma omp parallel for schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int n = 0; n < N; n++) {
        const float *xr = x + (size_t)n * D;
        double sum = 0.0;
        for (int i = 0; i < D; i++) sum += xr[i];
        float mean = (float)(sum / (double)D);
        double ssq = 0.0;
        for (int i = 0; i < D; i++) { double d = xr[i] - mean; ssq += d * d; }
        float invs = 1.0f / sqrtf((float)(ssq / (double)D) + eps);
        float *o = out + (size_t)n * D;
        for (int i = 0; i < D; i++) o[i] = (xr[i] - mean) * invs * gamma[i] + beta[i];
    }
}

/* GELU (exact, via erf) — torch default for nn.GELU. */
static inline float s3db_gelu_f32(float x)
{
    /* torch: x * 0.5 * (1 + erf(x / sqrt(2))) */
    return x * 0.5f * (1.0f + erff(x * 0.70710678118654752440f));
}

/* Scaled dot-product attention with B=1, H heads, head_dim D_h, emb = H*D_h.
 *   q (N_q, H*D_h), k (N_k, H*D_h), v (N_k, H*D_h), out (N_q, H*D_h).
 * Parallel over (h, n_q). Softmax applied per head per query with -max stab.
 * Memory for scores allocated per-thread via VLA; caller must ensure N_k
 * fits comfortably (used with N_k ∈ {145, 1024}). */
static void s3db_sdpa_f32(float *out, const float *q, const float *k,
                          const float *v, int N_q, int N_k, int H, int D_h,
                          int n_threads)
{
    const int E = H * D_h;
    const float scale = 1.0f / sqrtf((float)D_h);
    #if defined(_OPENMP)
    #pragma omp parallel for collapse(2) schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int h = 0; h < H; h++) {
        for (int nq = 0; nq < N_q; nq++) {
            /* alloc per-(h,nq) on the heap to avoid huge stack with VLA. */
            float *scores = (float *)malloc((size_t)N_k * sizeof(float));
            const float *qv = q + (size_t)nq * E + (size_t)h * D_h;
            float smax = -INFINITY;
            for (int nk = 0; nk < N_k; nk++) {
                const float *kv = k + (size_t)nk * E + (size_t)h * D_h;
                float s = 0.f;
                for (int d = 0; d < D_h; d++) s += qv[d] * kv[d];
                s *= scale;
                scores[nk] = s;
                if (s > smax) smax = s;
            }
            float sumexp = 0.f;
            for (int nk = 0; nk < N_k; nk++) {
                scores[nk] = expf(scores[nk] - smax);
                sumexp += scores[nk];
            }
            float inv = 1.0f / sumexp;
            float *o = out + (size_t)nq * E + (size_t)h * D_h;
            for (int d = 0; d < D_h; d++) {
                float acc = 0.f;
                for (int nk = 0; nk < N_k; nk++)
                    acc += scores[nk] * v[(size_t)nk * E + (size_t)h * D_h + d];
                o[d] = acc * inv;
            }
            free(scores);
        }
    }
}

/* Compute attn(q_in, k_in, v_in) with per-proj projection + output proj.
 *   q_in (N_q, Dq_in), k_in (N_k, Dk_in), v_in (N_k, Dv_in)
 *   Projected into (N_q, E) / (N_k, E) / (N_k, E) via q/k/v_proj.
 *   Output: (N_q, D_out) after output proj.
 * Scratch buffers allocated internally. */
static int s3db_attn_block(float *out,
                           const float *q_in, const float *k_in, const float *v_in,
                           int N_q, int N_k,
                           int Dq_in, int Dk_in, int Dv_in,
                           int H, int D_h, int D_out,
                           const float *Wq, const float *bq,
                           const float *Wk, const float *bk,
                           const float *Wv, const float *bv,
                           const float *Wproj, const float *bproj,
                           int n_threads)
{
    const int E = H * D_h;
    float *Q = (float *)malloc((size_t)N_q * E * sizeof(float));
    float *K = (float *)malloc((size_t)N_k * E * sizeof(float));
    float *V = (float *)malloc((size_t)N_k * E * sizeof(float));
    float *ctx = (float *)malloc((size_t)N_q * E * sizeof(float));
    if (!Q || !K || !V || !ctx) { free(Q); free(K); free(V); free(ctx); return -1; }
    s3db_linear_batch(Q, q_in, Wq, bq, N_q, Dq_in, E, n_threads);
    s3db_linear_batch(K, k_in, Wk, bk, N_k, Dk_in, E, n_threads);
    s3db_linear_batch(V, v_in, Wv, bv, N_k, Dv_in, E, n_threads);
    s3db_sdpa_f32(ctx, Q, K, V, N_q, N_k, H, D_h, n_threads);
    s3db_linear_batch(out, ctx, Wproj, bproj, N_q, E, D_out, n_threads);
    free(Q); free(K); free(V); free(ctx);
    return 0;
}

int sam3d_body_decoder_layer_forward(const sam3d_body_decoder_model *m,
                                     int layer_idx,
                                     const float *x_in,
                                     const float *context_in,
                                     const float *x_pe_in,
                                     const float *context_pe_in,
                                     int N_q, int N_c,
                                     int n_threads,
                                     float *x_out,
                                     float *context_out)
{
    if (!m || !x_in || !context_in || !x_pe_in || !context_pe_in || !x_out)
        return SAM3D_BODY_DECODER_E_INVAL;
    if (layer_idx < 0 || layer_idx >= m->n_layers)
        return SAM3D_BODY_DECODER_E_INVAL;
    const sam3d_body_decoder_layer *L = &m->layers[layer_idx];
    if (!L->ln1_w.data) return SAM3D_BODY_DECODER_E_LOAD;

    const int D   = m->dim;         /* 1024 */
    const int Dc  = m->kv_dim;      /* 1280 */
    const int H   = m->n_heads;     /* 8    */
    const int Dh  = m->head_dim;    /* 64   */
    const float eps = m->ln_eps;
    const int skip_first_pe = (layer_idx == 0);

