lighttransport/gemm/common/sam3d_body_decoder.h
    /* Pre-normalize x_pe / context_pe via ln_pe_{1,2}. */
    float *x_pe_n  = (float *)malloc((size_t)N_q * D  * sizeof(float));
    float *ctx_pe_n = (float *)malloc((size_t)N_c * Dc * sizeof(float));
    if (!x_pe_n || !ctx_pe_n) { free(x_pe_n); free(ctx_pe_n); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_layer_norm_batch(x_pe_n,  x_pe_in,  N_q, D,
                          (const float *)L->ln_pe_1_w.data,
                          (const float *)L->ln_pe_1_b.data, eps, n_threads);
    s3db_layer_norm_batch(ctx_pe_n, context_pe_in, N_c, Dc,
                          (const float *)L->ln_pe_2_w.data,
                          (const float *)L->ln_pe_2_b.data, eps, n_threads);

    /* ===== Self-attention block ===== */
    float *x_ln1 = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!x_ln1) { free(x_pe_n); free(ctx_pe_n); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_layer_norm_batch(x_ln1, x_in, N_q, D,
                          (const float *)L->ln1_w.data,
                          (const float *)L->ln1_b.data, eps, n_threads);

    /* q = k = x_ln1 + x_pe_n (unless skip_first_pe); v = x_ln1 */
    float *qk_buf = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!qk_buf) { free(x_pe_n); free(ctx_pe_n); free(x_ln1); return SAM3D_BODY_DECODER_E_LOAD; }
    if (skip_first_pe) {
        memcpy(qk_buf, x_ln1, (size_t)N_q * D * sizeof(float));
    } else {
        for (size_t i = 0; i < (size_t)N_q * D; i++) qk_buf[i] = x_ln1[i] + x_pe_n[i];
    }

    float *sa_out = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!sa_out) { free(x_pe_n); free(ctx_pe_n); free(x_ln1); free(qk_buf); return SAM3D_BODY_DECODER_E_LOAD; }
    int rc = s3db_attn_block(sa_out,
                             qk_buf, qk_buf, x_ln1,
                             N_q, N_q, D, D, D,
                             H, Dh, D,
                             (const float *)L->sa_q_w.data, (const float *)L->sa_q_b.data,
                             (const float *)L->sa_k_w.data, (const float *)L->sa_k_b.data,
                             (const float *)L->sa_v_w.data, (const float *)L->sa_v_b.data,
                             (const float *)L->sa_proj_w.data, (const float *)L->sa_proj_b.data,
                             n_threads);
    free(qk_buf); free(x_ln1);
    if (rc) { free(x_pe_n); free(ctx_pe_n); free(sa_out); return SAM3D_BODY_DECODER_E_LOAD; }

    /* x = x + sa_out */
    float *x1 = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!x1) { free(x_pe_n); free(ctx_pe_n); free(sa_out); return SAM3D_BODY_DECODER_E_LOAD; }
    for (size_t i = 0; i < (size_t)N_q * D; i++) x1[i] = x_in[i] + sa_out[i];
    free(sa_out);

    /* ===== Cross-attention block =====
     * q = ln2_1(x1) + x_pe_n
     * k = ln2_2(context) + ctx_pe_n
     * v = ln2_2(context)
     */
    float *q_in = (float *)malloc((size_t)N_q * D  * sizeof(float));
    float *ctx_ln = (float *)malloc((size_t)N_c * Dc * sizeof(float));
    if (!q_in || !ctx_ln) { free(x_pe_n); free(ctx_pe_n); free(x1); free(q_in); free(ctx_ln); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_layer_norm_batch(q_in, x1, N_q, D,
                          (const float *)L->ln2_1_w.data,
                          (const float *)L->ln2_1_b.data, eps, n_threads);
    for (size_t i = 0; i < (size_t)N_q * D; i++) q_in[i] += x_pe_n[i];
    s3db_layer_norm_batch(ctx_ln, context_in, N_c, Dc,
                          (const float *)L->ln2_2_w.data,
                          (const float *)L->ln2_2_b.data, eps, n_threads);
    /* k = ctx_ln + ctx_pe_n (separate buffer since v reads ctx_ln) */
    float *k_in = (float *)malloc((size_t)N_c * Dc * sizeof(float));
    if (!k_in) { free(x_pe_n); free(ctx_pe_n); free(x1); free(q_in); free(ctx_ln); return SAM3D_BODY_DECODER_E_LOAD; }
    for (size_t i = 0; i < (size_t)N_c * Dc; i++) k_in[i] = ctx_ln[i] + ctx_pe_n[i];

    float *ca_out = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!ca_out) { free(x_pe_n); free(ctx_pe_n); free(x1); free(q_in); free(ctx_ln); free(k_in); return SAM3D_BODY_DECODER_E_LOAD; }
    rc = s3db_attn_block(ca_out,
                         q_in, k_in, ctx_ln,
                         N_q, N_c, D, Dc, Dc,
                         H, Dh, D,
                         (const float *)L->ca_q_w.data, (const float *)L->ca_q_b.data,
                         (const float *)L->ca_k_w.data, (const float *)L->ca_k_b.data,
                         (const float *)L->ca_v_w.data, (const float *)L->ca_v_b.data,
                         (const float *)L->ca_proj_w.data, (const float *)L->ca_proj_b.data,
                         n_threads);
    free(q_in); free(k_in); free(ctx_ln);
    free(x_pe_n); free(ctx_pe_n);
    if (rc) { free(x1); free(ca_out); return SAM3D_BODY_DECODER_E_LOAD; }

    float *x2 = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!x2) { free(x1); free(ca_out); return SAM3D_BODY_DECODER_E_LOAD; }
    for (size_t i = 0; i < (size_t)N_q * D; i++) x2[i] = x1[i] + ca_out[i];
    free(x1); free(ca_out);

    /* ===== FFN =====
     * h = GELU(Linear0(ln3(x2)))
     * out = Linear1(h)
     * x = x2 + out
     */
    float *x_ln3 = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!x_ln3) { free(x2); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_layer_norm_batch(x_ln3, x2, N_q, D,
                          (const float *)L->ln3_w.data,
                          (const float *)L->ln3_b.data, eps, n_threads);

    const int H_ffn = m->ffn_hidden;   /* 1024 */
    float *ffn_h = (float *)malloc((size_t)N_q * H_ffn * sizeof(float));
    if (!ffn_h) { free(x2); free(x_ln3); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_linear_batch(ffn_h, x_ln3, (const float *)L->ffn0_w.data,
                      (const float *)L->ffn0_b.data, N_q, D, H_ffn, n_threads);
    free(x_ln3);
    for (size_t i = 0; i < (size_t)N_q * H_ffn; i++) ffn_h[i] = s3db_gelu_f32(ffn_h[i]);

    float *ffn_out = (float *)malloc((size_t)N_q * D * sizeof(float));
    if (!ffn_out) { free(x2); free(ffn_h); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_linear_batch(ffn_out, ffn_h, (const float *)L->ffn1_w.data,
                      (const float *)L->ffn1_b.data, N_q, H_ffn, D, n_threads);
    free(ffn_h);

