lighttransport/gemm/common/sam3d_body_decoder.h
    for (size_t i = 0; i < (size_t)N_q * D; i++) x_out[i] = x2[i] + ffn_out[i];
    free(x2); free(ffn_out);

    /* enable_twoway=False: context passes through unchanged. */
    if (context_out && context_out != context_in)
        memcpy(context_out, context_in, (size_t)N_c * Dc * sizeof(float));

    return SAM3D_BODY_DECODER_E_OK;
}

/* ---- Step 4g-i: keypoint-token update (combined 2D + 3D) ------------ */

/* Bilinear grid_sample at one (x, y) location, align_corners=False, padding
 * "zeros". src is (C, H, W) channel-major. dst (length C) is the sampled
 * vector. Out-of-bounds neighbors contribute 0. */
static void s3db_grid_sample_one(const float *src, int C, int H, int W,
                                 float gx_norm, float gy_norm, float *dst)
{
    /* PyTorch align_corners=False: input pixel = (norm + 1) * size / 2 - 0.5 */
    float xf = (gx_norm + 1.0f) * (float)W * 0.5f - 0.5f;
    float yf = (gy_norm + 1.0f) * (float)H * 0.5f - 0.5f;

    int x0 = (int)floorf(xf), x1 = x0 + 1;
    int y0 = (int)floorf(yf), y1 = y0 + 1;
    float ax = xf - (float)x0, ay = yf - (float)y0;

    float w00 = (1.0f - ax) * (1.0f - ay);
    float w10 = ax * (1.0f - ay);
    float w01 = (1.0f - ax) * ay;
    float w11 = ax * ay;

    int v00 = (x0 >= 0 && x0 < W && y0 >= 0 && y0 < H);
    int v10 = (x1 >= 0 && x1 < W && y0 >= 0 && y0 < H);
    int v01 = (x0 >= 0 && x0 < W && y1 >= 0 && y1 < H);
    int v11 = (x1 >= 0 && x1 < W && y1 >= 0 && y1 < H);

    size_t HW = (size_t)H * (size_t)W;
    for (int c = 0; c < C; c++) {
        const float *plane = src + (size_t)c * HW;
        float v = 0.0f;
        if (v00) v += w00 * plane[(size_t)y0 * W + x0];
        if (v10) v += w10 * plane[(size_t)y0 * W + x1];
        if (v01) v += w01 * plane[(size_t)y1 * W + x0];
        if (v11) v += w11 * plane[(size_t)y1 * W + x1];
        dst[c] = v;
    }
}

int sam3d_body_kp_token_update(const sam3d_body_decoder_model *m,
                               int layer_idx,
                               const float *image_emb,
                               int H, int W,
                               const float *kp2d_cropped,
                               const float *kp2d_depth,
                               const float *kp3d_camera,
                               int N_q,
                               int n_threads,
                               float *tokens,
                               float *token_augment)
{
    if (!m || !tokens || !token_augment || !image_emb ||
        !kp2d_cropped || !kp2d_depth || !kp3d_camera)
        return SAM3D_BODY_DECODER_E_INVAL;

    /* Last-layer short-circuit (matches upstream guard). */
    if (layer_idx == m->n_layers - 1) return SAM3D_BODY_DECODER_E_OK;

    const int D     = m->dim;          /* 1024 */
    const int C_img = m->kv_dim;       /* 1280 */
    const int K     = m->n_keypoints;  /* 70 */
    const int kp2d_start = 1 + 1 + 1 + m->n_hand_tokens;          /* 5  */
    const int kp3d_start = kp2d_start + K;                         /* 75 */
    if (kp3d_start + K > N_q) return SAM3D_BODY_DECODER_E_INVAL;

    /* ---- 2D update -------------------------------------------------- */

    /* Build the 70x2 input pred_keypoints_2d_cropped (already in -0.5..0.5).
     * invalid_mask: out-of-bounds in [0,1] after +0.5, OR depth < 1e-5.
     */
    int *invalid = (int *)malloc((size_t)K * sizeof(int));
    if (!invalid) return SAM3D_BODY_DECODER_E_LOAD;
    for (int i = 0; i < K; i++) {
        float x01 = kp2d_cropped[i*2 + 0] + 0.5f;
        float y01 = kp2d_cropped[i*2 + 1] + 0.5f;
        invalid[i] = (x01 < 0.0f) || (x01 > 1.0f)
                  || (y01 < 0.0f) || (y01 > 1.0f)
                  || (kp2d_depth[i] < 1e-5f);
    }

    /* keypoint_posemb_linear: Linear(2,D) → ReLU → Linear(D,D), no identity. */
    float *posemb_h   = (float *)malloc((size_t)K * D * sizeof(float));
    float *posemb_out = (float *)malloc((size_t)K * D * sizeof(float));
    if (!posemb_h || !posemb_out) {
        free(invalid); free(posemb_h); free(posemb_out);
        return SAM3D_BODY_DECODER_E_LOAD;
    }
    s3db_linear_batch(posemb_h, kp2d_cropped,
                      (const float *)m->kp_posemb_l0_w.data,
                      (const float *)m->kp_posemb_l0_b.data,
                      K, 2, D, n_threads);
    for (size_t i = 0; i < (size_t)K * D; i++)
        if (posemb_h[i] < 0.0f) posemb_h[i] = 0.0f;
    s3db_linear_batch(posemb_out, posemb_h,
                      (const float *)m->kp_posemb_l1_w.data,
                      (const float *)m->kp_posemb_l1_b.data,
                      K, D, D, n_threads);
    free(posemb_h);

    /* token_augment[5..75) = posemb * (~invalid) — overwrite. */
    for (int i = 0; i < K; i++) {
        float *dst = token_augment + (size_t)(kp2d_start + i) * D;
        if (invalid[i]) {
            for (int d = 0; d < D; d++) dst[d] = 0.0f;
        } else {
            const float *src = posemb_out + (size_t)i * D;
            for (int d = 0; d < D; d++) dst[d] = src[d];
        }
    }
    free(posemb_out);

    /* grid_sample: sample_points = pred_keypoints_2d_cropped * 2 (so they
     * land in [-1, 1]). Image is 32x32 (DINOv3 H+ patch grid). */
    float *kp_feats = (float *)calloc((size_t)K * C_img, sizeof(float));
    if (!kp_feats) { free(invalid); return SAM3D_BODY_DECODER_E_LOAD; }
    #if defined(_OPENMP)
    #pragma omp parallel for schedule(static) num_threads(n_threads > 0 ? n_threads : 1)
    #endif
    for (int i = 0; i < K; i++) {
        if (invalid[i]) continue;  /* zero from calloc */
        float gx = kp2d_cropped[i*2 + 0] * 2.0f;
        float gy = kp2d_cropped[i*2 + 1] * 2.0f;
        /* ViT-H width-crops a square crop before the backbone; upstream scales
         * x by H/W for those backbones only. Rectangular DINOv3 inputs do not
         * take this correction even when H != W. */
        if (m->kp_sample_scale_x && W != H) gx *= (float)H / (float)W;
        s3db_grid_sample_one(image_emb, C_img, H, W, gx, gy,
                             kp_feats + (size_t)i * C_img);
    }

    /* keypoint_feat_linear: Linear(C_img, D). Then ADD to tokens[5..75). */
    float *kp_feat_proj = (float *)malloc((size_t)K * D * sizeof(float));
    if (!kp_feat_proj) { free(invalid); free(kp_feats); return SAM3D_BODY_DECODER_E_LOAD; }
    s3db_linear_batch(kp_feat_proj, kp_feats,
                      (const float *)m->kp_feat_linear_w.data,
                      (const float *)m->kp_feat_linear_b.data,
                      K, C_img, D, n_threads);
    free(kp_feats);

