lighttransport/gemm/common/sam3d_body_decoder.h
    for (int i = 0; i < K; i++) {
        float *dst = tokens + (size_t)(kp2d_start + i) * D;
        const float *src = kp_feat_proj + (size_t)i * D;
        for (int d = 0; d < D; d++) dst[d] += src[d];
    }
    free(kp_feat_proj);
    free(invalid);

    /* ---- 3D update -------------------------------------------------- */

    /* Pelvis-normalize: subtract (kp[9] + kp[10]) / 2 from every kp. */
    float pelvis[3];
    pelvis[0] = (kp3d_camera[9*3 + 0] + kp3d_camera[10*3 + 0]) * 0.5f;
    pelvis[1] = (kp3d_camera[9*3 + 1] + kp3d_camera[10*3 + 1]) * 0.5f;
    pelvis[2] = (kp3d_camera[9*3 + 2] + kp3d_camera[10*3 + 2]) * 0.5f;
    float *kp3d_norm = (float *)malloc((size_t)K * 3 * sizeof(float));
    if (!kp3d_norm) return SAM3D_BODY_DECODER_E_LOAD;
    for (int i = 0; i < K; i++) {
        kp3d_norm[i*3 + 0] = kp3d_camera[i*3 + 0] - pelvis[0];
        kp3d_norm[i*3 + 1] = kp3d_camera[i*3 + 1] - pelvis[1];
        kp3d_norm[i*3 + 2] = kp3d_camera[i*3 + 2] - pelvis[2];
    }

    /* keypoint3d_posemb_linear: Linear(3,D) → ReLU → Linear(D,D). */
    float *p3_h   = (float *)malloc((size_t)K * D * sizeof(float));
    float *p3_out = (float *)malloc((size_t)K * D * sizeof(float));
    if (!p3_h || !p3_out) {
        free(kp3d_norm); free(p3_h); free(p3_out);
        return SAM3D_BODY_DECODER_E_LOAD;
    }
    s3db_linear_batch(p3_h, kp3d_norm,
                      (const float *)m->kp3d_posemb_l0_w.data,
                      (const float *)m->kp3d_posemb_l0_b.data,
                      K, 3, D, n_threads);
    free(kp3d_norm);
    for (size_t i = 0; i < (size_t)K * D; i++)
        if (p3_h[i] < 0.0f) p3_h[i] = 0.0f;
    s3db_linear_batch(p3_out, p3_h,
                      (const float *)m->kp3d_posemb_l1_w.data,
                      (const float *)m->kp3d_posemb_l1_b.data,
                      K, D, D, n_threads);
    free(p3_h);

    /* token_augment[75..145) = kp3d_posemb (overwrite). */
    for (int i = 0; i < K; i++) {
        float *dst = token_augment + (size_t)(kp3d_start + i) * D;
        const float *src = p3_out + (size_t)i * D;
        for (int d = 0; d < D; d++) dst[d] = src[d];
    }
    free(p3_out);

    return SAM3D_BODY_DECODER_E_OK;
}

/* ---- norm_final + MHR regression heads (step 4f-A) ------------------ */

int sam3d_body_norm_final(const sam3d_body_decoder_model *m,
                          const float *x_in, int N_q, int n_threads,
                          float *x_out)
{
    if (!m || !x_in || !x_out) return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->norm_final_w.data || !m->norm_final_b.data)
        return SAM3D_BODY_DECODER_E_LOAD;
    s3db_layer_norm_batch(x_out, x_in, N_q, m->dim,
                          (const float *)m->norm_final_w.data,
                          (const float *)m->norm_final_b.data,
                          m->ln_eps, n_threads);
    return SAM3D_BODY_DECODER_E_OK;
}

int sam3d_body_apply_heads_raw(const sam3d_body_decoder_model *m,
                               const float *pose_token,
                               int n_threads,
                               float *out_pose_raw,
                               float *out_cam_raw)
{
    if (!m || !pose_token || !out_pose_raw || !out_cam_raw)
        return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->head_pose_l0_w.data || !m->head_camera_l0_w.data)
        return SAM3D_BODY_DECODER_E_LOAD;

    const int D = m->dim;       /* 1024 */
    const int Np = m->npose;    /* 519 */
    const int Nc = m->ncam;     /* 3   */

    /* head_pose.proj: Linear(D→D) → GELU → Linear(D→519) */
    float *h = (float *)malloc((size_t)D * sizeof(float));
    if (!h) return SAM3D_BODY_DECODER_E_LOAD;

    s3db_linear_batch(h, pose_token,
                      (const float *)m->head_pose_l0_w.data,
                      (const float *)m->head_pose_l0_b.data,
                      1, D, D, n_threads);
    for (int i = 0; i < D; i++) h[i] = h[i] > 0.0f ? h[i] : 0.0f; /* ReLU — FFN default act_layer */
    s3db_linear_batch(out_pose_raw, h,
                      (const float *)m->head_pose_l1_w.data,
                      (const float *)m->head_pose_l1_b.data,
                      1, D, Np, n_threads);

    /* head_camera.proj: Linear(D→D) → ReLU → Linear(D→3) */
    s3db_linear_batch(h, pose_token,
                      (const float *)m->head_camera_l0_w.data,
                      (const float *)m->head_camera_l0_b.data,
                      1, D, D, n_threads);
    for (int i = 0; i < D; i++) h[i] = h[i] > 0.0f ? h[i] : 0.0f;
    s3db_linear_batch(out_cam_raw, h,
                      (const float *)m->head_camera_l1_w.data,
                      (const float *)m->head_camera_l1_b.data,
                      1, D, Nc, n_threads);

    free(h);
    return SAM3D_BODY_DECODER_E_OK;
}

/* ================================================================== */
/* Head decode (stages 1-5): pose_raw[519] -> mhr_model_params[204] +  */
/*                            shape[45] + face[72]                     */
/* ================================================================== */

/* Body params: 23 three-DoF Euler XYZ joints, scattered into 133-vec.
 * Layout per joint: 3 indices in `body3dof_idxs[j*3..j*3+3]`. Mirror of
 * `all_param_3dof_rot_idxs` in mhr_utils.compact_cont_to_model_params_body. */
static const int s3db_body3dof_idxs[23 * 3] = {
    0, 2, 4,    6, 8, 10,    12, 13, 14,   15, 16, 17,   18, 19, 20,
    21, 22, 23, 24, 25, 26,  27, 28, 29,   34, 35, 36,   37, 38, 39,
    44, 45, 46, 53, 54, 55,  64, 65, 66,
    85, 69, 73, 86, 70, 79,  87, 71, 82,   88, 72, 76,   91, 92, 93,
    112, 96, 100, 113, 97, 106, 114, 98, 109, 115, 99, 103,
    130, 131, 132,
};
/* 58 single-DoF rotation slots into 133-vec (sin/cos pairs in cont). */
static const int s3db_body1dof_rot_idxs[58] = {
    1, 3, 5, 7, 9, 11, 30, 31, 32, 33, 40, 41, 42, 43, 47, 48, 49, 50, 51, 52,
    56, 57, 58, 59, 60, 61, 62, 63, 67, 68, 74, 75, 77, 78, 80, 81, 83, 84,
    89, 90, 94, 95, 101, 102, 104, 105, 107, 108, 110, 111, 116, 117, 118,
    119, 120, 121, 122, 123,
};
/* 6 translation slots (passed through directly from cont). */
static const int s3db_body1dof_trans_idxs[6] = { 124, 125, 126, 127, 128, 129 };

/* Hand mask: zero these slots in body_pose_euler[133] before drop-in. */
static const int s3db_mhr_hand_idxs[54] = {
    62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,
    86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,
    107,108,109,110,111,112,113,114,115,
};

