lighttransport/gemm/common/sam3d_body_decoder.h
/* Hand interleaved DoF spec: [3,1,1,3,1,1,3,1,1,3,1,1,2,3,1,1] sums to 27.
 * Per joint, output dim = k. cont input dim per joint = 2*k.
 * Total cont = 54, total model_params = 27. */
static const int s3db_hand_dof_seq[16] = { 3,1,1,3,1,1,3,1,1,3,1,1,2,3,1,1 };

static inline float s3db_dot3(const float *a, const float *b)
{ return a[0]*b[0] + a[1]*b[1] + a[2]*b[2]; }

static inline void s3db_normalize3(float *v)
{
    double n2 = (double)v[0]*v[0] + (double)v[1]*v[1] + (double)v[2]*v[2];
    if (n2 < 1e-20) return;
    float s = (float)(1.0 / sqrt(n2));
    v[0] *= s; v[1] *= s; v[2] *= s;
}

/* rot6d_to_rotmat: 6 → 3×3 (column-major: cols=b1,b2,b3). */
static void s3db_rot6d_to_rotmat(const float *x6, float R[9])
{
    /* Per upstream: x = x.reshape(-1,2,3).permute(0,2,1) → (3,2)
     *   a1 = first 3 elements, a2 = next 3 elements. */
    float a1[3] = { x6[0], x6[1], x6[2] };
    float a2[3] = { x6[3], x6[4], x6[5] };
    float b1[3] = { a1[0], a1[1], a1[2] };
    s3db_normalize3(b1);
    float dot = s3db_dot3(b1, a2);
    float b2[3] = { a2[0]-dot*b1[0], a2[1]-dot*b1[1], a2[2]-dot*b1[2] };
    s3db_normalize3(b2);
    float b3[3] = { b1[1]*b2[2]-b1[2]*b2[1],
                    b1[2]*b2[0]-b1[0]*b2[2],
                    b1[0]*b2[1]-b1[1]*b2[0] };
    /* R: col0=b1, col1=b2, col2=b3, row-major flat */
    R[0]=b1[0]; R[1]=b2[0]; R[2]=b3[0];
    R[3]=b1[1]; R[4]=b2[1]; R[5]=b3[1];
    R[6]=b1[2]; R[7]=b2[2]; R[8]=b3[2];
}

/* roma "ZYX" intrinsic Euler from rotmat: returns [αz, βy, γx] s.t.
 * R = Rz(αz) Ry(βy) Rx(γx). */
static void s3db_rotmat_to_euler_zyx(const float R[9], float out3[3])
{
    /* R[2,0] = -sy   →   sy = -R[6] */
    /* R[1,0]/R[0,0] = sz/cz when cy>0 */
    /* R[2,1]/R[2,2] = sx/cx when cy>0 */
    float r20 = R[6];
    float cy = sqrtf(R[0]*R[0] + R[3]*R[3]);
    out3[1] = atan2f(-r20, cy);             /* βy */
    out3[0] = atan2f(R[3], R[0]);           /* αz */
    out3[2] = atan2f(R[7], R[8]);           /* γx */
}

/* roma "xyz" Euler convention is extrinsic xyz, equivalent to
 * `R = Rz(c) @ Ry(b) @ Rx(a)` with input order [a, b, c].
 * Same matrix shape as ZYX [αz, βy, γx] = (a=γx, b=βy, c=αz).
 *
 *   R[0,0]=cz*cb       R[0,1]=cz*sb*sa-sz*ca   R[0,2]=cz*sb*ca+sz*sa
 *   R[1,0]=sz*cb       R[1,1]=sz*sb*sa+cz*ca   R[1,2]=sz*sb*ca-cz*sa
 *   R[2,0]=-sb         R[2,1]=cb*sa            R[2,2]=cb*ca
 */
static void s3db_euler_xyz_to_rotmat(const float e[3], float R[9])
{
    float a = e[0], b = e[1], c = e[2];
    float ca = cosf(a), sa = sinf(a);
    float cb = cosf(b), sb = sinf(b);
    float cz = cosf(c), sz = sinf(c);
    R[0] = cz*cb;      R[1] = cz*sb*sa - sz*ca;  R[2] = cz*sb*ca + sz*sa;
    R[3] = sz*cb;      R[4] = sz*sb*sa + cz*ca;  R[5] = sz*sb*ca - cz*sa;
    R[6] = -sb;        R[7] = cb*sa;             R[8] = cb*ca;
}

static void s3db_rotmat_to_euler_xyz(const float R[9], float out3[3])
{
    /* sb = -R[2,0]; cb = sqrt(R[0,0]² + R[1,0]²). */
    float cb = sqrtf(R[0]*R[0] + R[3]*R[3]);
    out3[1] = atan2f(-R[6], cb);                /* b */
    out3[0] = atan2f(R[7], R[8]);               /* a */
    out3[2] = atan2f(R[3], R[0]);               /* c */
}

/* 3x3 matmul: C = A @ B (row-major, all 3x3). */
static inline void s3db_mat3_mm(const float A[9], const float B[9], float C[9])
{
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 3; j++) {
            float s = 0.0f;
            for (int k = 0; k < 3; k++) s += A[i*3+k] * B[k*3+j];
            C[i*3+j] = s;
        }
    }
}

/* y = M @ x (3x3 @ 3). */
static inline void s3db_mat3_mv(const float M[9], const float x[3], float y[3])
{
    y[0] = M[0]*x[0] + M[1]*x[1] + M[2]*x[2];
    y[1] = M[3]*x[0] + M[4]*x[1] + M[5]*x[2];
    y[2] = M[6]*x[0] + M[7]*x[1] + M[8]*x[2];
}

/* batchXYZfrom6D: cont[6] → Euler XYZ[3].
 *
 * Per upstream: x_raw = poses[..., :3]; y_raw = poses[..., 3:];
 *   x = norm(x_raw); z = norm(cross(x, y_raw)); y = cross(z, x);
 *   M = stack([x, y, z], dim=-1)  (cols)
 * Then extract XYZ Euler via:
 *   sy = sqrt(M[0,0]² + M[1,0]²)
 *   if not singular:
 *     ex = atan2(M[2,1], M[2,2])
 *     ey = atan2(-M[2,0], sy)
 *     ez = atan2(M[1,0], M[0,0])
 *   else:
 *     ex = atan2(-M[1,2], M[1,1])
 *     ey = atan2(-M[2,0], sy)
 *     ez = 0
 */
static void s3db_xyz_from_6d(const float *cont6, float out3[3])
{
    float x[3]   = { cont6[0], cont6[1], cont6[2] };
    float yraw[3]= { cont6[3], cont6[4], cont6[5] };
    s3db_normalize3(x);
    float z[3] = { x[1]*yraw[2]-x[2]*yraw[1],
                   x[2]*yraw[0]-x[0]*yraw[2],
                   x[0]*yraw[1]-x[1]*yraw[0] };
    s3db_normalize3(z);
    float y[3] = { z[1]*x[2]-z[2]*x[1],
                   z[2]*x[0]-z[0]*x[2],
                   z[0]*x[1]-z[1]*x[0] };
    /* M cols=[x,y,z] flat row-major: M[i,j] */
    float M[9] = {
        x[0], y[0], z[0],
        x[1], y[1], z[1],
        x[2], y[2], z[2],
    };
    float sy = sqrtf(M[0]*M[0] + M[3]*M[3]);
    int singular = sy < 1e-6f;
    float ex, ey, ez;
    if (!singular) {
        ex = atan2f(M[7], M[8]);
        ey = atan2f(-M[6], sy);
        ez = atan2f(M[3], M[0]);
    } else {
        ex = atan2f(-M[5], M[4]);
        ey = atan2f(-M[6], sy);
        ez = 0.0f;
    }
    out3[0] = ex; out3[1] = ey; out3[2] = ez;
}

/* compact_cont_to_model_params_body: 260 → 133 */
static void s3db_compact_cont_to_body(const float *cont260, float *body133)
{
    memset(body133, 0, 133 * sizeof(float));
    /* 23 × 6D → 23 × XYZ_Euler scattered into 69 slots. */
    const int N3 = 23;
    for (int j = 0; j < N3; j++) {
        float xyz[3];
        s3db_xyz_from_6d(cont260 + j * 6, xyz);
        body133[s3db_body3dof_idxs[j*3 + 0]] = xyz[0];
        body133[s3db_body3dof_idxs[j*3 + 1]] = xyz[1];
        body133[s3db_body3dof_idxs[j*3 + 2]] = xyz[2];
    }
    /* 58 sincos pairs → atan2 → 58 slots. cont layout after 138 dims. */
    const int N1 = 58;
    const float *p1 = cont260 + 23 * 6;  /* offset 138 */
    for (int j = 0; j < N1; j++) {
        float s = p1[j*2 + 0];
        float c = p1[j*2 + 1];
        body133[s3db_body1dof_rot_idxs[j]] = atan2f(s, c);
    }
    /* 6 translation passthrough. cont layout after 138 + 116 = 254 dims. */
    const float *pt = cont260 + 138 + 116;
    for (int j = 0; j < 6; j++) {
        body133[s3db_body1dof_trans_idxs[j]] = pt[j];
    }
}

/* compact_cont_to_model_params_hand: 54 cont → 27 model_params.
 * Walks `s3db_hand_dof_seq` interleaving the 3DoF blocks (6 cont → 3 params
 * via batchXYZfrom6D) and 1/2DoF blocks (2 cont → atan2 angle). */
static void s3db_compact_cont_to_hand(const float *cont54, float *hand27)
{
    int ci = 0;     /* read cursor into cont54 */
    int mi = 0;     /* write cursor into hand27 */
    for (int i = 0; i < 16; i++) {
        int k = s3db_hand_dof_seq[i];
        if (k == 3) {
            float xyz[3];
            s3db_xyz_from_6d(cont54 + ci, xyz);
            hand27[mi+0] = xyz[0];
            hand27[mi+1] = xyz[1];
            hand27[mi+2] = xyz[2];
            ci += 6;
            mi += 3;
        } else {
            /* k==1 or k==2: each "joint" emits k atan2 angles, taking
             * 2*k cont dims as k sincos pairs. The Python uses unflatten
             * (-1, (-1, 2)) and then takes [..., -2], [..., -1] which
             * means s = pair[0], c = pair[1]. */
            for (int kk = 0; kk < k; kk++) {
                float s = cont54[ci + 0];
                float c = cont54[ci + 1];
                hand27[mi] = atan2f(s, c);
                ci += 2;
                mi += 1;
            }
        }
    }
    /* Sanity: ci==54, mi==27. */
}

int sam3d_body_decode_pose_raw(const sam3d_body_decoder_model *m,
                               const float *pose_raw,
                               int enable_hand_model,
                               float *out_mhr_model_params,
                               float *out_shape,
                               float *out_face)
{
    if (!m || !pose_raw || !out_mhr_model_params || !out_shape || !out_face)
        return SAM3D_BODY_DECODER_E_INVAL;

