lighttransport/gemm/common/sam3d_body_decoder.h
    /* --- Stage 1+2: rot6d → rotmat → ZYX Euler. */
    float R[9];
    s3db_rot6d_to_rotmat(pose_raw + 0, R);
    float global_rot_euler[3];
    s3db_rotmat_to_euler_zyx(R, global_rot_euler);

    /* --- Stage 3: body cont → 133 Euler model params, then mask. */
    float body133[133];
    s3db_compact_cont_to_body(pose_raw + 6, body133);
    /* zero hand idxs */
    for (int i = 0; i < 54; i++) body133[s3db_mhr_hand_idxs[i]] = 0.0f;
    /* zero last 3 (jaw) */
    body133[130] = 0.0f; body133[131] = 0.0f; body133[132] = 0.0f;

    /* --- enable_hand_model branch (mhr_head.py mhr_forward lines 181-196):
     *   R_xyz = euler_to_rotmat("xyz", global_rot_ori)        # convention switch
     *   R_new = R_xyz @ local_to_world_wrist
     *   global_rot = rotmat_to_euler("xyz", R_new)
     *   global_trans = -(euler_to_rotmat("xyz", global_rot)
     *                    @ (right_wrist_coords - root_coords)
     *                    + root_coords)                       # global_trans_ori = 0
     * Body branch keeps global_rot=ZYX-Euler and global_trans=0. */
    float grot_used[3];
    float global_trans[3] = { 0.0f, 0.0f, 0.0f };
    if (enable_hand_model) {
        const float *L2W = (const float *)m->local_to_world_wrist.data;
        const float *RWC = (const float *)m->right_wrist_coords.data;
        const float *RC  = (const float *)m->root_coords.data;
        float Rxyz_ori[9], Rwrist[9], grot_xyz[3];
        s3db_euler_xyz_to_rotmat(global_rot_euler, Rxyz_ori);
        s3db_mat3_mm(Rxyz_ori, L2W, Rwrist);
        s3db_rotmat_to_euler_xyz(Rwrist, grot_xyz);
        float Rxyz_new[9];
        s3db_euler_xyz_to_rotmat(grot_xyz, Rxyz_new);
        float wrist_off[3] = { RWC[0]-RC[0], RWC[1]-RC[1], RWC[2]-RC[2] };
        float Rw[3];
        s3db_mat3_mv(Rxyz_new, wrist_off, Rw);
        global_trans[0] = -(Rw[0] + RC[0]);
        global_trans[1] = -(Rw[1] + RC[1]);
        global_trans[2] = -(Rw[2] + RC[2]);
        grot_used[0] = grot_xyz[0];
        grot_used[1] = grot_xyz[1];
        grot_used[2] = grot_xyz[2];
    } else {
        grot_used[0] = global_rot_euler[0];
        grot_used[1] = global_rot_euler[1];
        grot_used[2] = global_rot_euler[2];
    }

    /* --- Stage 4a: assemble full_pose_params(136) =
     *   [trans*10(3), global_rot(3), body133[:130]]. */
    float full_pose[136];
    full_pose[0] = global_trans[0] * 10.0f;
    full_pose[1] = global_trans[1] * 10.0f;
    full_pose[2] = global_trans[2] * 10.0f;
    full_pose[3] = grot_used[0];
    full_pose[4] = grot_used[1];
    full_pose[5] = grot_used[2];
    memcpy(full_pose + 6, body133, 130 * sizeof(float));

    /* --- Stage 4b: hand PCA decode + drop-in.
     *   pred_hand[108] = [left_pca(54); right_pca(54)]
     *   for each side: cont = hand_pose_mean + pca @ hand_pose_comps  → (54,)
     *                  model = compact_cont_to_hand(cont)             → (27,)
     *                  full_pose[hand_idx_*]] = model
     * hand_pose_comps shape: (54, 54). einsum("da,ab->db", pca, comps):
     *   cont[b] = sum_a pca[a] * comps[a, b]
     */
    const float *pred_hand_l = pose_raw + 339;
    const float *pred_hand_r = pose_raw + 339 + 54;
    const float *hpm = (const float *)m->hand_pose_mean.data;
    const float *hpc = (const float *)m->hand_pose_comps.data;
    const int64_t *hil = (const int64_t *)m->hand_idx_left.data;
    const int64_t *hir = (const int64_t *)m->hand_idx_right.data;
    for (int side = 0; side < 2; side++) {
        const float *pca = (side == 0) ? pred_hand_l : pred_hand_r;
        const int64_t *hi = (side == 0) ? hil : hir;
        float cont54[54];
        for (int b = 0; b < 54; b++) {
            double s = (double)hpm[b];
            for (int a = 0; a < 54; a++) {
                s += (double)pca[a] * (double)hpc[a*54 + b];
            }
            cont54[b] = (float)s;
        }
        float hand27[27];
        s3db_compact_cont_to_hand(cont54, hand27);
        for (int j = 0; j < 27; j++) {
            full_pose[hi[j]] = hand27[j];
        }
    }

    /* --- Stage 5: scales = scale_mean + pred_scale @ scale_comps. */
    float scales68[68];
    const float *sm = (const float *)m->scale_mean.data;
    const float *sc = (const float *)m->scale_comps.data;  /* (28, 68) */
    const float *pred_scale = pose_raw + 311;
    for (int b = 0; b < 68; b++) {
        double s = (double)sm[b];
        for (int a = 0; a < 28; a++) {
            s += (double)pred_scale[a] * (double)sc[a*68 + b];
        }
        scales68[b] = (float)s;
    }

    /* --- Assemble (204,) and the side outputs. */
    memcpy(out_mhr_model_params,        full_pose, 136 * sizeof(float));
    memcpy(out_mhr_model_params + 136,  scales68,   68 * sizeof(float));

    /* --- Stage 5b: nonhand zero-out (mhr_head.py:225) — hand branch only. */
    if (enable_hand_model) {
        const int64_t *nz = (const int64_t *)m->nonhand_param_idxs.data;
        size_t n_nz = (size_t)m->nonhand_param_idxs.dims[0];
        for (size_t i = 0; i < n_nz; i++) {
            out_mhr_model_params[nz[i]] = 0.0f;
        }
    }

    memcpy(out_shape, pose_raw + 266, 45 * sizeof(float));
    /* expr_params zeroed in body-only branch (mhr_head.py line 316). */
    (void)out_face;
    memset(out_face, 0, 72 * sizeof(float));

    return SAM3D_BODY_DECODER_E_OK;
}

/* ================================================================== */
/* Stage 12: 70-keypoint regression                                    */
/* ================================================================== */
int sam3d_body_keypoints_from_mesh(const sam3d_body_decoder_model *m,
                                   const float *verts_m,
                                   const float *joint_coords_m,
                                   int enable_hand_model,
                                   int n_threads,
                                   float *out_kpts)
{
    (void)n_threads;
    if (!m || !verts_m || !joint_coords_m || !out_kpts)
        return SAM3D_BODY_DECODER_E_INVAL;
    if (!m->keypoint_mapping.data) return SAM3D_BODY_DECODER_E_LOAD;

    const int V = 18439;
    const int J = 127;
    const int VJ = V + J;       /* 18566 */
    const int NK = 70;
    const float *KM = (const float *)m->keypoint_mapping.data;  /* (308, 18566) */

    /* For each of the first 70 keypoints: out[k, c] = sum_i KM[k,i] * X[i,c].
     * X[i,c] = verts_m[i,c] for i<V, joint_coords_m[i-V,c] for i in [V, VJ).
     * Body path: head_pose has enable_hand_model=False, all 70 computed.
     * Hand path: keep [21, 42); zero [0, 21) and [42, 70) (mhr_head.py:255). */
    memset(out_kpts, 0, NK * 3 * sizeof(float));
    int k_lo = enable_hand_model ? 21 : 0;
    int k_hi = enable_hand_model ? 42 : NK;
    for (int k = k_lo; k < k_hi; k++) {
        const float *Wk = KM + (size_t)k * VJ;
        double sx = 0.0, sy = 0.0, sz = 0.0;
        for (int i = 0; i < V; i++) {
            double w = (double)Wk[i];
            sx += w * (double)verts_m[i*3 + 0];
            sy += w * (double)verts_m[i*3 + 1];
            sz += w * (double)verts_m[i*3 + 2];
        }
        for (int i = 0; i < J; i++) {
            double w = (double)Wk[V + i];
            sx += w * (double)joint_coords_m[i*3 + 0];
            sy += w * (double)joint_coords_m[i*3 + 1];
            sz += w * (double)joint_coords_m[i*3 + 2];
        }
        /* Camera-system flip on (y, z). */
        out_kpts[k*3 + 0] = (float)sx;
        out_kpts[k*3 + 1] = (float)(-sy);
        out_kpts[k*3 + 2] = (float)(-sz);
    }
    return SAM3D_BODY_DECODER_E_OK;
}

