lighttransport/gemm/common/sam3d_body_decoder.h
/* ================================================================== */
/* camera_project + _full_to_crop                                       */
/* ================================================================== */
int sam3d_body_camera_project(const float *j3d_post_flip,
                              const float *pred_cam,
                              const sam3d_body_camera_batch *batch,
                              int K,
                              float *out_kp2d,
                              float *out_kp2d_cropped,
                              float *out_kp2d_depth,
                              float *out_pred_cam_t)
{
    if (!j3d_post_flip || !pred_cam || !batch || K <= 0)
        return SAM3D_BODY_DECODER_E_INVAL;

    /* Apply camera-system flip on pred_cam: pc[0] *= -1; pc[2] *= -1. */
    const float s  = -pred_cam[0];
    const float tx =  pred_cam[1];
    const float ty = -pred_cam[2];

    const float scale_factor = (batch->default_scale_factor > 0.0f)
                               ? batch->default_scale_factor : 1.0f;
    const float bs = batch->bbox_scale * s * scale_factor + 1e-8f;
    const float fx = batch->cam_int[0];          /* K[0,0] */
    const float tz = 2.0f * fx / bs;
    float cx, cy;
    if (!batch->use_intrin_center) {
        cx = 2.0f * (batch->bbox_center[0] - batch->ori_img_size[0] * 0.5f) / bs;
        cy = 2.0f * (batch->bbox_center[1] - batch->ori_img_size[1] * 0.5f) / bs;
    } else {
        cx = 2.0f * (batch->bbox_center[0] - batch->cam_int[2]) / bs;
        cy = 2.0f * (batch->bbox_center[1] - batch->cam_int[5]) / bs;
    }
    const float ct[3] = { tx + cx, ty + cy, tz };
    if (out_pred_cam_t) {
        out_pred_cam_t[0] = ct[0];
        out_pred_cam_t[1] = ct[1];
        out_pred_cam_t[2] = ct[2];
    }

    const float *KM = batch->cam_int;            /* (3,3) row-major */
    const float *AT = batch->affine_trans;       /* (2,3) row-major */
    const float invIW = 1.0f / batch->img_size[0];
    const float invIH = 1.0f / batch->img_size[1];

    for (int k = 0; k < K; k++) {
        float p0 = j3d_post_flip[k*3 + 0] + ct[0];
        float p1 = j3d_post_flip[k*3 + 1] + ct[1];
        float p2 = j3d_post_flip[k*3 + 2] + ct[2];
        if (out_kp2d_depth) out_kp2d_depth[k] = p2;

        /* Perspective: y = K @ (p / p.z), take first two channels. */
        float invz = 1.0f / p2;
        float xn = p0 * invz, yn = p1 * invz;
        float u = KM[0] * xn + KM[1] * yn + KM[2];
        float v = KM[3] * xn + KM[4] * yn + KM[5];
        if (out_kp2d) {
            out_kp2d[k*2 + 0] = u;
            out_kp2d[k*2 + 1] = v;
        }
        if (out_kp2d_cropped) {
            float ax = AT[0]*u + AT[1]*v + AT[2];
            float ay = AT[3]*u + AT[4]*v + AT[5];
            out_kp2d_cropped[k*2 + 0] = ax * invIW - 0.5f;
            out_kp2d_cropped[k*2 + 1] = ay * invIH - 0.5f;
        }
    }
    return SAM3D_BODY_DECODER_E_OK;
}

/* sam3d_body_decoder_forward implementation lives in the
 * SAM3D_BODY_DECODER_FULL_IMPLEMENTATION block below — it depends on
 * forward_full + sam3d_body_mhr_forward. */

int sam3d_body_decoder_forward_preset(
    const sam3d_body_decoder_model *m,
    const float *image_emb_chw,
    const float *image_pe_chw,
    int H, int W,
    const float *initial_tokens,
    const float *initial_augment,
    const float *kp2d_cropped_pl,
    const float *kp2d_depth_pl,
    const float *kp3d_pl,
    int n_threads,
    sam3d_body_decoder_result *out)
{
    if (!m || !image_emb_chw || !image_pe_chw ||
        !initial_tokens || !initial_augment || !out)
        return SAM3D_BODY_DECODER_E_INVAL;
    if (!kp2d_cropped_pl || !kp2d_depth_pl || !kp3d_pl)
        return SAM3D_BODY_DECODER_E_INVAL;

    const int N_Q = 1 + 1 + 1 + m->n_hand_tokens
                  + m->n_keypoints + m->n_keypoints;       /* 145 */
    const int D   = m->dim;                                /* 1024 */
    const int N_C = H * W;                                 /* 1024 for 32×32 */
    const int Dc  = m->kv_dim;                             /* 1280 */
    const int K   = m->n_keypoints;                        /* 70 */

    /* Flatten (Dc, H, W) → (H*W, Dc) once for image_emb and image_pe. */
    float *ctx    = (float *)malloc((size_t)N_C * Dc * sizeof(float));
    float *ctx_pe = (float *)malloc((size_t)N_C * Dc * sizeof(float));
    if (!ctx || !ctx_pe) { free(ctx); free(ctx_pe); return SAM3D_BODY_DECODER_E_LOAD; }
    for (int n = 0; n < N_C; n++) {
        for (int c = 0; c < Dc; c++) {
            ctx[(size_t)n * Dc + c]    = image_emb_chw[(size_t)c * N_C + n];
            ctx_pe[(size_t)n * Dc + c] = image_pe_chw[(size_t)c * N_C + n];
        }
    }

    /* Working buffers for tokens / augment, ping-pong. */
    float *tokens   = (float *)malloc((size_t)N_Q * D * sizeof(float));
    float *augment  = (float *)malloc((size_t)N_Q * D * sizeof(float));
    float *tokens_b = (float *)malloc((size_t)N_Q * D * sizeof(float));
    if (!tokens || !augment || !tokens_b) {
        free(ctx); free(ctx_pe); free(tokens); free(augment); free(tokens_b);
        return SAM3D_BODY_DECODER_E_LOAD;
    }
    memcpy(tokens,  initial_tokens,  (size_t)N_Q * D * sizeof(float));
    memcpy(augment, initial_augment, (size_t)N_Q * D * sizeof(float));

    for (int li = 0; li < m->n_layers; li++) {
        int rc = sam3d_body_decoder_layer_forward(
            m, li, tokens, ctx, augment, ctx_pe, N_Q, N_C,
            n_threads, tokens_b, NULL);
        if (rc != SAM3D_BODY_DECODER_E_OK) {
            free(ctx); free(ctx_pe); free(tokens); free(augment); free(tokens_b);
            return rc;
        }
        /* Swap tokens <- tokens_b. */
        float *tmp = tokens; tokens = tokens_b; tokens_b = tmp;

        /* Apply preset kp_token_update between layers (skip after last). */
        if (li < m->n_layers - 1) {
            const float *kp2d  = kp2d_cropped_pl + (size_t)li * K * 2;
            const float *dep   = kp2d_depth_pl   + (size_t)li * K;
            const float *kp3d  = kp3d_pl         + (size_t)li * K * 3;
            rc = sam3d_body_kp_token_update(
                m, li, image_emb_chw, H, W, kp2d, dep, kp3d, N_Q,
                n_threads, tokens, augment);
            if (rc != SAM3D_BODY_DECODER_E_OK) {
                free(ctx); free(ctx_pe); free(tokens); free(augment); free(tokens_b);
                return rc;
            }
        }
    }
    free(ctx); free(ctx_pe); free(tokens_b);

    /* Final norm + heads. */
    float *tokens_norm = (float *)malloc((size_t)N_Q * D * sizeof(float));
    if (!tokens_norm) { free(tokens); free(augment); return SAM3D_BODY_DECODER_E_LOAD; }
    int rc = sam3d_body_norm_final(m, tokens, N_Q, n_threads, tokens_norm);
    free(tokens); free(augment);
    if (rc != SAM3D_BODY_DECODER_E_OK) { free(tokens_norm); return rc; }

    float pose_raw[519];
    float cam_raw[3];
    rc = sam3d_body_apply_heads_raw(m, tokens_norm, n_threads, pose_raw, cam_raw);
    free(tokens_norm);
    if (rc != SAM3D_BODY_DECODER_E_OK) return rc;

