lighttransport/gemm/common/sam3d_body_decoder.h
    /* Add init_pose / init_camera (matches FFN(add_identity=False) path). */
    const float *ip = (const float *)m->init_pose.data;
    const float *ic = (const float *)m->init_camera.data;
    for (int i = 0; i < 519; i++) out->mhr_params[i] = pose_raw[i] + ip[i];
    for (int i = 0; i < 3;   i++) out->cam_t[i]      = cam_raw[i]  + ic[i];
    return SAM3D_BODY_DECODER_E_OK;
}

/* ================================================================== */
/* Iterative forward: decoder + per-layer MHR-in-the-loop              */
/* ================================================================== */

#ifdef SAM3D_BODY_DECODER_FULL_IMPLEMENTATION

/* Helper: from gskel (J, 8) extract jcoords (J, 3) and divide by 100. */
static void s3db_extract_jcoords_meters(const float *gskel_cm, int J,
                                        float *jc_m_out)
{
    for (int j = 0; j < J; j++) {
        jc_m_out[j*3 + 0] = gskel_cm[(size_t)j*8 + 0] * 0.01f;
        jc_m_out[j*3 + 1] = gskel_cm[(size_t)j*8 + 1] * 0.01f;
        jc_m_out[j*3 + 2] = gskel_cm[(size_t)j*8 + 2] * 0.01f;
    }
}

int sam3d_body_decoder_forward_full(
    const sam3d_body_decoder_model *m,
    const struct sam3d_body_mhr_assets_t *mhr,
    const sam3d_body_camera_batch *cam_batch,
    const float *image_emb_chw,
    const float *image_pe_chw,
    int H, int W,
    const float *initial_tokens,
    const float *initial_augment,
    int n_threads,
    sam3d_body_decoder_full_result *out)
{
    if (!m || !mhr || !cam_batch || !image_emb_chw || !image_pe_chw ||
        !initial_tokens || !initial_augment || !out)
        return SAM3D_BODY_DECODER_E_INVAL;

    const int N_Q = 1 + 1 + 1 + m->n_hand_tokens
                  + m->n_keypoints + m->n_keypoints;       /* 145 */
    const int D   = m->dim;                                /* 1024 */
    const int N_C = H * W;                                 /* 1024 for 32×32 */
    const int Dc  = m->kv_dim;                             /* 1280 */
    const int K   = m->n_keypoints;                        /* 70 */
    const int V   = 18439;
    const int J   = 127;

    const float *ip = (const float *)m->init_pose.data;
    const float *ic = (const float *)m->init_camera.data;

    /* Flatten image_emb / pe (CHW → HW×C) once. */
    float *ctx        = (float *)malloc((size_t)N_C * Dc * sizeof(float));
    float *ctx_pe     = (float *)malloc((size_t)N_C * Dc * sizeof(float));
    /* Token ping-pong + intermediate norm. */
    float *tokens     = (float *)malloc((size_t)N_Q * D  * sizeof(float));
    float *augment    = (float *)malloc((size_t)N_Q * D  * sizeof(float));
    float *tokens_b   = (float *)malloc((size_t)N_Q * D  * sizeof(float));
    float *tokens_n   = (float *)malloc((size_t)N_Q * D  * sizeof(float));
    /* MHR scratch + outputs (per layer reused, plus final). */
    const size_t mhr_scratch_floats = (size_t)1 *
        (889 + (size_t)J*8*2 + (size_t)V*3*3);
    float *mhr_scratch = (float *)malloc(mhr_scratch_floats * sizeof(float));
    float *verts_cm    = (float *)malloc((size_t)V * 3 * sizeof(float));
    float *gskel_cm    = (float *)malloc((size_t)J * 8 * sizeof(float));
    float *verts_m     = (float *)malloc((size_t)V * 3 * sizeof(float));
    float *jc_m        = (float *)malloc((size_t)J * 3 * sizeof(float));

    if (!ctx || !ctx_pe || !tokens || !augment || !tokens_b || !tokens_n ||
        !mhr_scratch || !verts_cm || !gskel_cm || !verts_m || !jc_m) {
        free(ctx); free(ctx_pe); free(tokens); free(augment); free(tokens_b);
        free(tokens_n); free(mhr_scratch); free(verts_cm); free(gskel_cm);
        free(verts_m); free(jc_m);
        return SAM3D_BODY_DECODER_E_LOAD;
    }

    for (int n = 0; n < N_C; n++) {
        for (int c = 0; c < Dc; c++) {
            ctx   [(size_t)n * Dc + c] = image_emb_chw[(size_t)c * N_C + n];
            ctx_pe[(size_t)n * Dc + c] = image_pe_chw [(size_t)c * N_C + n];
        }
    }
    memcpy(tokens,  initial_tokens,  (size_t)N_Q * D * sizeof(float));
    memcpy(augment, initial_augment, (size_t)N_Q * D * sizeof(float));

    int rc = SAM3D_BODY_DECODER_E_OK;
    float pose_raw[519], cam_raw[3];
    float pose519[519], cam3[3];
    float mp_buf[204], shape_buf[45], face_buf[72];
    float kp3d_post_flip[70 * 3];
    float kp2d_full[70 * 2], kp2d_crop[70 * 2], kp2d_dep[70];
    float pred_cam_t_world[3];

    for (int li = 0; li < m->n_layers; li++) {
        rc = sam3d_body_decoder_layer_forward(
                m, li, tokens, ctx, augment, ctx_pe, N_Q, N_C,
                n_threads, tokens_b, NULL);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;
        { float *tmp = tokens; tokens = tokens_b; tokens_b = tmp; }

        if (out->dbg_layer_tokens_out)
            memcpy(out->dbg_layer_tokens_out + (size_t)li * N_Q * D,
                   tokens, (size_t)N_Q * D * sizeof(float));

        if (li >= m->n_layers - 1) break;

        /* Per-layer pose_output. norm_final → tokens_n. */
        rc = sam3d_body_norm_final(m, tokens, N_Q, n_threads, tokens_n);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

        rc = sam3d_body_apply_heads_raw(m, tokens_n /* pose_token at row 0 */,
                                        n_threads, pose_raw, cam_raw);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;
        if (out->dbg_layer_pose_raw)
            memcpy(out->dbg_layer_pose_raw + (size_t)li * 519,
                   pose_raw, 519 * sizeof(float));
        for (int i = 0; i < 519; i++) pose519[i] = pose_raw[i] + ip[i];
        for (int i = 0; i < 3;   i++) cam3[i]    = cam_raw[i]  + ic[i];

        rc = sam3d_body_decode_pose_raw(m, pose519, /*enable_hand_model*/0,
                                        mp_buf, shape_buf, face_buf);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

        /* mhr_forward: outputs in cm. apply_correctives=1 (do_pcblend=True
         * upstream default at intermediate token_to_pose_output_fn). */
        rc = sam3d_body_mhr_forward((const sam3d_body_mhr_assets *)mhr,
                                    mp_buf, shape_buf, face_buf,
                                    1, 1, n_threads, mhr_scratch,
                                    verts_cm, gskel_cm);
        if (rc) { rc = SAM3D_BODY_DECODER_E_LOAD; goto done; }

        /* cm → m. */
        for (int i = 0; i < V * 3; i++) verts_m[i] = verts_cm[i] * 0.01f;
        s3db_extract_jcoords_meters(gskel_cm, J, jc_m);

        rc = sam3d_body_keypoints_from_mesh(m, verts_m, jc_m,
                                            /*enable_hand_model*/0,
                                            n_threads, kp3d_post_flip);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

        rc = sam3d_body_camera_project(kp3d_post_flip, cam3, cam_batch, K,
                                       kp2d_full, kp2d_crop, kp2d_dep,
                                       pred_cam_t_world);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

        if (out->dbg_layer_kp3d)
            memcpy(out->dbg_layer_kp3d + (size_t)li * K * 3,
                   kp3d_post_flip, (size_t)K * 3 * sizeof(float));
        if (out->dbg_layer_kp2d_crop)
            memcpy(out->dbg_layer_kp2d_crop + (size_t)li * K * 2,
                   kp2d_crop, (size_t)K * 2 * sizeof(float));
        if (out->dbg_layer_kp2d_depth)
            memcpy(out->dbg_layer_kp2d_depth + (size_t)li * K,
                   kp2d_dep, (size_t)K * sizeof(float));
        if (out->dbg_layer_cam_t)
            memcpy(out->dbg_layer_cam_t + (size_t)li * 3,
                   pred_cam_t_world, 3 * sizeof(float));

