lighttransport/gemm/common/sam3d_body_decoder.h
        rc = sam3d_body_kp_token_update(
                m, li, image_emb_chw, H, W,
                kp2d_crop, kp2d_dep, kp3d_post_flip,
                N_Q, n_threads, tokens, augment);
        if (rc != SAM3D_BODY_DECODER_E_OK) goto done;
    }

    /* Final norm + heads. */
    rc = sam3d_body_norm_final(m, tokens, N_Q, n_threads, tokens_n);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

    rc = sam3d_body_apply_heads_raw(m, tokens_n, n_threads, pose_raw, cam_raw);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done;
    for (int i = 0; i < 519; i++) out->mhr_params[i] = pose_raw[i] + ip[i];
    for (int i = 0; i < 3;   i++) out->cam_t[i]      = cam_raw[i]  + ic[i];

    rc = sam3d_body_decode_pose_raw(m, out->mhr_params, /*enable_hand_model*/0,
                                    mp_buf, shape_buf, face_buf);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

    rc = sam3d_body_mhr_forward((const sam3d_body_mhr_assets *)mhr,
                                mp_buf, shape_buf, face_buf,
                                1, 1, n_threads, mhr_scratch,
                                verts_cm, gskel_cm);
    if (rc) { rc = SAM3D_BODY_DECODER_E_LOAD; goto done; }

    for (int i = 0; i < V * 3; i++) verts_m[i] = verts_cm[i] * 0.01f;
    s3db_extract_jcoords_meters(gskel_cm, J, jc_m);

    rc = sam3d_body_keypoints_from_mesh(m, verts_m, jc_m,
                                        /*enable_hand_model*/0,
                                        n_threads, out->pred_keypoints_3d);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

    rc = sam3d_body_camera_project(out->pred_keypoints_3d, out->cam_t,
                                   cam_batch, K,
                                   out->pred_keypoints_2d,
                                   out->pred_keypoints_2d_cropped,
                                   out->pred_keypoints_2d_depth,
                                   out->pred_cam_t_world);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done;

    /* Optional outputs. Vertices: post-flip cam frame in m. */
    if (out->pred_vertices) {
        for (int i = 0; i < V; i++) {
            out->pred_vertices[i*3 + 0] =  verts_m[i*3 + 0];
            out->pred_vertices[i*3 + 1] = -verts_m[i*3 + 1];
            out->pred_vertices[i*3 + 2] = -verts_m[i*3 + 2];
        }
    }
    if (out->mhr_model_params) memcpy(out->mhr_model_params, mp_buf,
                                      204 * sizeof(float));
    if (out->shape) memcpy(out->shape, shape_buf, 45 * sizeof(float));
    if (out->face)  memcpy(out->face,  face_buf,  72 * sizeof(float));
    if (out->global_skel) memcpy(out->global_skel, gskel_cm,
                                 (size_t)J * 8 * sizeof(float));

done:
    free(ctx); free(ctx_pe); free(tokens); free(augment); free(tokens_b);
    free(tokens_n); free(mhr_scratch); free(verts_cm); free(gskel_cm);
    free(verts_m); free(jc_m);
    return rc;
}

int sam3d_body_decoder_forward(
    const sam3d_body_decoder_model *m,
    const struct sam3d_body_mhr_assets_t *mhr,
    const sam3d_body_camera_batch *cam_batch,
    const float *image_tokens_patch,
    int H, int W,
    const float *rays_hwc,
    const float *condition_info,
    int n_threads,
    sam3d_body_decoder_full_result *out)
{
    if (!m || !mhr || !cam_batch || !image_tokens_patch || !rays_hwc ||
        !condition_info || !out)
        return SAM3D_BODY_DECODER_E_INVAL;
    if (H <= 0 || W <= 0)
        return SAM3D_BODY_DECODER_E_INVAL;

    const int Dc = m->kv_dim;                              /* 1280 */
    const int D  = m->dim;                                 /* 1024 */
    const int N_Q = 1 + 1 + 1 + m->n_hand_tokens
                  + m->n_keypoints + m->n_keypoints;       /* 145 */
    const int N_C = H * W;
    const size_t b_emb = (size_t)Dc * (size_t)N_C * sizeof(float);

    int rc = SAM3D_BODY_DECODER_E_OK;
    float *img_emb_pre  = NULL;
    float *img_emb_post = NULL;
    float *img_pe_chw   = NULL;
    float *tokens_init  = NULL;
    float *augment_init = NULL;

    img_emb_pre  = (float *)malloc(b_emb);
    img_emb_post = (float *)malloc(b_emb);
    img_pe_chw   = (float *)malloc(b_emb);
    tokens_init  = (float *)calloc(N_Q * D, sizeof(float));
    augment_init = (float *)calloc(N_Q * D, sizeof(float));
    if (!img_emb_pre || !img_emb_post || !img_pe_chw ||
        !tokens_init || !augment_init) {
        rc = SAM3D_BODY_DECODER_E_INVAL;
        goto done_fwd;
    }

    /* Transpose patch tokens (H*W, Dc) → (Dc, H*W). */
    for (int p = 0; p < N_C; p++) {
        const float *src = image_tokens_patch + (size_t)p * Dc;
        for (int c = 0; c < Dc; c++) {
            img_emb_pre[(size_t)c * N_C + p] = src[c];
        }
    }

    rc = sam3d_body_ray_cond_emb_forward(m, img_emb_pre, rays_hwc, H, W,
                                         n_threads, img_emb_post);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done_fwd;

    rc = sam3d_body_get_dense_pe(m, H, W, n_threads, img_pe_chw);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done_fwd;

    const float *ip = (const float *)m->init_pose.data;     /* (519,) */
    const float *ic = (const float *)m->init_camera.data;   /* (3,)   */
    float init_input[525];
    float prev_input[522];
    float prompt_in[1280];
    memcpy(init_input,            condition_info, 3   * sizeof(float));
    memcpy(init_input + 3,        ip,             519 * sizeof(float));
    memcpy(init_input + 3 + 519,  ic,             3   * sizeof(float));
    memcpy(prev_input,            ip,             519 * sizeof(float));
    memcpy(prev_input + 519,      ic,             3   * sizeof(float));
    rc = sam3d_body_invalid_prompt_token(m, prompt_in);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done_fwd;

    rc = sam3d_body_build_tokens(m, init_input, prev_input, prompt_in,
                                 n_threads, tokens_init, augment_init);
    if (rc != SAM3D_BODY_DECODER_E_OK) goto done_fwd;

    rc = sam3d_body_decoder_forward_full(
            m, mhr, cam_batch,
            img_emb_post, img_pe_chw, H, W,
            tokens_init, augment_init,
            n_threads, out);

done_fwd:
    free(img_emb_pre); free(img_emb_post); free(img_pe_chw);
    free(tokens_init); free(augment_init);
    return rc;
}

#endif /* SAM3D_BODY_DECODER_FULL_IMPLEMENTATION */

#endif /* SAM3D_BODY_DECODER_IMPLEMENTATION */
#endif /* SAM3D_BODY_DECODER_H */
